{"class_name": "Model", "config": {"name": "model_495", "layers": [{"name": "conv1d_5929_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5929_input"}, "inbound_nodes": []}, {"name": "conv1d_5932_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5932_input"}, "inbound_nodes": []}, {"name": "conv1d_5935_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5935_input"}, "inbound_nodes": []}, {"name": "conv1d_5938_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5938_input"}, "inbound_nodes": []}, {"name": "conv1d_5929", "class_name": "Conv1D", "config": {"name": "conv1d_5929", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5929_input", 0, 0, {}]]]}, {"name": "conv1d_5932", "class_name": "Conv1D", "config": {"name": "conv1d_5932", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5932_input", 0, 0, {}]]]}, {"name": "conv1d_5935", "class_name": "Conv1D", "config": {"name": "conv1d_5935", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5935_input", 0, 0, {}]]]}, {"name": "conv1d_5938", "class_name": "Conv1D", "config": {"name": "conv1d_5938", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5938_input", 0, 0, {}]]]}, {"name": "max_pooling1d_5929", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5929", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5929", 0, 0, {}]]]}, {"name": "max_pooling1d_5932", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5932", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5932", 0, 0, {}]]]}, {"name": "max_pooling1d_5935", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5935", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5935", 0, 0, {}]]]}, {"name": "max_pooling1d_5938", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5938", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5938", 0, 0, {}]]]}, {"name": "conv1d_5930", "class_name": "Conv1D", "config": {"name": "conv1d_5930", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5929", 0, 0, {}]]]}, {"name": "conv1d_5933", "class_name": "Conv1D", "config": {"name": "conv1d_5933", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5932", 0, 0, {}]]]}, {"name": "conv1d_5936", "class_name": "Conv1D", "config": {"name": "conv1d_5936", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5935", 0, 0, {}]]]}, {"name": "conv1d_5939", "class_name": "Conv1D", "config": {"name": "conv1d_5939", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5938", 0, 0, {}]]]}, {"name": "max_pooling1d_5930", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5930", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5930", 0, 0, {}]]]}, {"name": "max_pooling1d_5933", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5933", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5933", 0, 0, {}]]]}, {"name": "max_pooling1d_5936", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5936", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5936", 0, 0, {}]]]}, {"name": "max_pooling1d_5939", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5939", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5939", 0, 0, {}]]]}, {"name": "conv1d_5931", "class_name": "Conv1D", "config": {"name": "conv1d_5931", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5930", 0, 0, {}]]]}, {"name": "conv1d_5934", "class_name": "Conv1D", "config": {"name": "conv1d_5934", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5933", 0, 0, {}]]]}, {"name": "conv1d_5937", "class_name": "Conv1D", "config": {"name": "conv1d_5937", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5936", 0, 0, {}]]]}, {"name": "conv1d_5940", "class_name": "Conv1D", "config": {"name": "conv1d_5940", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5939", 0, 0, {}]]]}, {"name": "max_pooling1d_5931", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5931", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5931", 0, 0, {}]]]}, {"name": "max_pooling1d_5934", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5934", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5934", 0, 0, {}]]]}, {"name": "max_pooling1d_5937", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5937", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5937", 0, 0, {}]]]}, {"name": "max_pooling1d_5940", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5940", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5940", 0, 0, {}]]]}, {"name": "flatten_1977", "class_name": "Flatten", "config": {"name": "flatten_1977", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5931", 0, 0, {}]]]}, {"name": "flatten_1978", "class_name": "Flatten", "config": {"name": "flatten_1978", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5934", 0, 0, {}]]]}, {"name": "flatten_1979", "class_name": "Flatten", "config": {"name": "flatten_1979", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5937", 0, 0, {}]]]}, {"name": "flatten_1980", "class_name": "Flatten", "config": {"name": "flatten_1980", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5940", 0, 0, {}]]]}, {"name": "concatenate_495", "class_name": "Concatenate", "config": {"name": "concatenate_495", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_1977", 0, 0, {}], ["flatten_1978", 0, 0, {}], ["flatten_1979", 0, 0, {}], ["flatten_1980", 0, 0, {}]]]}, {"name": "dense_989", "class_name": "Dense", "config": {"name": "dense_989", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_495", 0, 0, {}]]]}, {"name": "dense_990", "class_name": "Dense", "config": {"name": "dense_990", "trainable": true, "units": 2, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_989", 0, 0, {}]]]}], "input_layers": [["conv1d_5929_input", 0, 0], ["conv1d_5932_input", 0, 0], ["conv1d_5935_input", 0, 0], ["conv1d_5938_input", 0, 0]], "output_layers": [["dense_990", 0, 0]]}, "keras_version": "2.2.4", "backend": "theano"}