{"class_name": "Model", "config": {"name": "model_491", "layers": [{"name": "conv1d_5881_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5881_input"}, "inbound_nodes": []}, {"name": "conv1d_5884_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5884_input"}, "inbound_nodes": []}, {"name": "conv1d_5887_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5887_input"}, "inbound_nodes": []}, {"name": "conv1d_5890_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5890_input"}, "inbound_nodes": []}, {"name": "conv1d_5881", "class_name": "Conv1D", "config": {"name": "conv1d_5881", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5881_input", 0, 0, {}]]]}, {"name": "conv1d_5884", "class_name": "Conv1D", "config": {"name": "conv1d_5884", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5884_input", 0, 0, {}]]]}, {"name": "conv1d_5887", "class_name": "Conv1D", "config": {"name": "conv1d_5887", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5887_input", 0, 0, {}]]]}, {"name": "conv1d_5890", "class_name": "Conv1D", "config": {"name": "conv1d_5890", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5890_input", 0, 0, {}]]]}, {"name": "max_pooling1d_5881", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5881", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5881", 0, 0, {}]]]}, {"name": "max_pooling1d_5884", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5884", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5884", 0, 0, {}]]]}, {"name": "max_pooling1d_5887", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5887", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5887", 0, 0, {}]]]}, {"name": "max_pooling1d_5890", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5890", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5890", 0, 0, {}]]]}, {"name": "conv1d_5882", "class_name": "Conv1D", "config": {"name": "conv1d_5882", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5881", 0, 0, {}]]]}, {"name": "conv1d_5885", "class_name": "Conv1D", "config": {"name": "conv1d_5885", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5884", 0, 0, {}]]]}, {"name": "conv1d_5888", "class_name": "Conv1D", "config": {"name": "conv1d_5888", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5887", 0, 0, {}]]]}, {"name": "conv1d_5891", "class_name": "Conv1D", "config": {"name": "conv1d_5891", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5890", 0, 0, {}]]]}, {"name": "max_pooling1d_5882", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5882", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5882", 0, 0, {}]]]}, {"name": "max_pooling1d_5885", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5885", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5885", 0, 0, {}]]]}, {"name": "max_pooling1d_5888", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5888", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5888", 0, 0, {}]]]}, {"name": "max_pooling1d_5891", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5891", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5891", 0, 0, {}]]]}, {"name": "conv1d_5883", "class_name": "Conv1D", "config": {"name": "conv1d_5883", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5882", 0, 0, {}]]]}, {"name": "conv1d_5886", "class_name": "Conv1D", "config": {"name": "conv1d_5886", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5885", 0, 0, {}]]]}, {"name": "conv1d_5889", "class_name": "Conv1D", "config": {"name": "conv1d_5889", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5888", 0, 0, {}]]]}, {"name": "conv1d_5892", "class_name": "Conv1D", "config": {"name": "conv1d_5892", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5891", 0, 0, {}]]]}, {"name": "max_pooling1d_5883", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5883", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5883", 0, 0, {}]]]}, {"name": "max_pooling1d_5886", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5886", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5886", 0, 0, {}]]]}, {"name": "max_pooling1d_5889", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5889", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5889", 0, 0, {}]]]}, {"name": "max_pooling1d_5892", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5892", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5892", 0, 0, {}]]]}, {"name": "flatten_1961", "class_name": "Flatten", "config": {"name": "flatten_1961", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5883", 0, 0, {}]]]}, {"name": "flatten_1962", "class_name": "Flatten", "config": {"name": "flatten_1962", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5886", 0, 0, {}]]]}, {"name": "flatten_1963", "class_name": "Flatten", "config": {"name": "flatten_1963", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5889", 0, 0, {}]]]}, {"name": "flatten_1964", "class_name": "Flatten", "config": {"name": "flatten_1964", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5892", 0, 0, {}]]]}, {"name": "concatenate_491", "class_name": "Concatenate", "config": {"name": "concatenate_491", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_1961", 0, 0, {}], ["flatten_1962", 0, 0, {}], ["flatten_1963", 0, 0, {}], ["flatten_1964", 0, 0, {}]]]}, {"name": "dense_981", "class_name": "Dense", "config": {"name": "dense_981", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_491", 0, 0, {}]]]}, {"name": "dense_982", "class_name": "Dense", "config": {"name": "dense_982", "trainable": true, "units": 2, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_981", 0, 0, {}]]]}], "input_layers": [["conv1d_5881_input", 0, 0], ["conv1d_5884_input", 0, 0], ["conv1d_5887_input", 0, 0], ["conv1d_5890_input", 0, 0]], "output_layers": [["dense_982", 0, 0]]}, "keras_version": "2.2.4", "backend": "theano"}