{"class_name": "Model", "config": {"name": "model_492", "layers": [{"name": "conv1d_5893_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5893_input"}, "inbound_nodes": []}, {"name": "conv1d_5896_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5896_input"}, "inbound_nodes": []}, {"name": "conv1d_5899_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5899_input"}, "inbound_nodes": []}, {"name": "conv1d_5902_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5902_input"}, "inbound_nodes": []}, {"name": "conv1d_5893", "class_name": "Conv1D", "config": {"name": "conv1d_5893", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5893_input", 0, 0, {}]]]}, {"name": "conv1d_5896", "class_name": "Conv1D", "config": {"name": "conv1d_5896", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5896_input", 0, 0, {}]]]}, {"name": "conv1d_5899", "class_name": "Conv1D", "config": {"name": "conv1d_5899", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5899_input", 0, 0, {}]]]}, {"name": "conv1d_5902", "class_name": "Conv1D", "config": {"name": "conv1d_5902", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5902_input", 0, 0, {}]]]}, {"name": "max_pooling1d_5893", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5893", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5893", 0, 0, {}]]]}, {"name": "max_pooling1d_5896", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5896", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5896", 0, 0, {}]]]}, {"name": "max_pooling1d_5899", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5899", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5899", 0, 0, {}]]]}, {"name": "max_pooling1d_5902", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5902", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5902", 0, 0, {}]]]}, {"name": "conv1d_5894", "class_name": "Conv1D", "config": {"name": "conv1d_5894", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5893", 0, 0, {}]]]}, {"name": "conv1d_5897", "class_name": "Conv1D", "config": {"name": "conv1d_5897", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5896", 0, 0, {}]]]}, {"name": "conv1d_5900", "class_name": "Conv1D", "config": {"name": "conv1d_5900", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5899", 0, 0, {}]]]}, {"name": "conv1d_5903", "class_name": "Conv1D", "config": {"name": "conv1d_5903", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5902", 0, 0, {}]]]}, {"name": "max_pooling1d_5894", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5894", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5894", 0, 0, {}]]]}, {"name": "max_pooling1d_5897", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5897", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5897", 0, 0, {}]]]}, {"name": "max_pooling1d_5900", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5900", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5900", 0, 0, {}]]]}, {"name": "max_pooling1d_5903", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5903", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5903", 0, 0, {}]]]}, {"name": "conv1d_5895", "class_name": "Conv1D", "config": {"name": "conv1d_5895", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5894", 0, 0, {}]]]}, {"name": "conv1d_5898", "class_name": "Conv1D", "config": {"name": "conv1d_5898", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5897", 0, 0, {}]]]}, {"name": "conv1d_5901", "class_name": "Conv1D", "config": {"name": "conv1d_5901", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5900", 0, 0, {}]]]}, {"name": "conv1d_5904", "class_name": "Conv1D", "config": {"name": "conv1d_5904", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5903", 0, 0, {}]]]}, {"name": "max_pooling1d_5895", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5895", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5895", 0, 0, {}]]]}, {"name": "max_pooling1d_5898", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5898", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5898", 0, 0, {}]]]}, {"name": "max_pooling1d_5901", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5901", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5901", 0, 0, {}]]]}, {"name": "max_pooling1d_5904", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5904", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5904", 0, 0, {}]]]}, {"name": "flatten_1965", "class_name": "Flatten", "config": {"name": "flatten_1965", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5895", 0, 0, {}]]]}, {"name": "flatten_1966", "class_name": "Flatten", "config": {"name": "flatten_1966", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5898", 0, 0, {}]]]}, {"name": "flatten_1967", "class_name": "Flatten", "config": {"name": "flatten_1967", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5901", 0, 0, {}]]]}, {"name": "flatten_1968", "class_name": "Flatten", "config": {"name": "flatten_1968", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5904", 0, 0, {}]]]}, {"name": "concatenate_492", "class_name": "Concatenate", "config": {"name": "concatenate_492", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_1965", 0, 0, {}], ["flatten_1966", 0, 0, {}], ["flatten_1967", 0, 0, {}], ["flatten_1968", 0, 0, {}]]]}, {"name": "dense_983", "class_name": "Dense", "config": {"name": "dense_983", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_492", 0, 0, {}]]]}, {"name": "dense_984", "class_name": "Dense", "config": {"name": "dense_984", "trainable": true, "units": 2, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_983", 0, 0, {}]]]}], "input_layers": [["conv1d_5893_input", 0, 0], ["conv1d_5896_input", 0, 0], ["conv1d_5899_input", 0, 0], ["conv1d_5902_input", 0, 0]], "output_layers": [["dense_984", 0, 0]]}, "keras_version": "2.2.4", "backend": "theano"}