{"class_name": "Model", "config": {"name": "model_493", "layers": [{"name": "conv1d_5905_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5905_input"}, "inbound_nodes": []}, {"name": "conv1d_5908_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5908_input"}, "inbound_nodes": []}, {"name": "conv1d_5911_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5911_input"}, "inbound_nodes": []}, {"name": "conv1d_5914_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5914_input"}, "inbound_nodes": []}, {"name": "conv1d_5905", "class_name": "Conv1D", "config": {"name": "conv1d_5905", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5905_input", 0, 0, {}]]]}, {"name": "conv1d_5908", "class_name": "Conv1D", "config": {"name": "conv1d_5908", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5908_input", 0, 0, {}]]]}, {"name": "conv1d_5911", "class_name": "Conv1D", "config": {"name": "conv1d_5911", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5911_input", 0, 0, {}]]]}, {"name": "conv1d_5914", "class_name": "Conv1D", "config": {"name": "conv1d_5914", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5914_input", 0, 0, {}]]]}, {"name": "max_pooling1d_5905", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5905", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5905", 0, 0, {}]]]}, {"name": "max_pooling1d_5908", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5908", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5908", 0, 0, {}]]]}, {"name": "max_pooling1d_5911", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5911", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5911", 0, 0, {}]]]}, {"name": "max_pooling1d_5914", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5914", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5914", 0, 0, {}]]]}, {"name": "conv1d_5906", "class_name": "Conv1D", "config": {"name": "conv1d_5906", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5905", 0, 0, {}]]]}, {"name": "conv1d_5909", "class_name": "Conv1D", "config": {"name": "conv1d_5909", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5908", 0, 0, {}]]]}, {"name": "conv1d_5912", "class_name": "Conv1D", "config": {"name": "conv1d_5912", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5911", 0, 0, {}]]]}, {"name": "conv1d_5915", "class_name": "Conv1D", "config": {"name": "conv1d_5915", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5914", 0, 0, {}]]]}, {"name": "max_pooling1d_5906", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5906", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5906", 0, 0, {}]]]}, {"name": "max_pooling1d_5909", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5909", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5909", 0, 0, {}]]]}, {"name": "max_pooling1d_5912", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5912", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5912", 0, 0, {}]]]}, {"name": "max_pooling1d_5915", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5915", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5915", 0, 0, {}]]]}, {"name": "conv1d_5907", "class_name": "Conv1D", "config": {"name": "conv1d_5907", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5906", 0, 0, {}]]]}, {"name": "conv1d_5910", "class_name": "Conv1D", "config": {"name": "conv1d_5910", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5909", 0, 0, {}]]]}, {"name": "conv1d_5913", "class_name": "Conv1D", "config": {"name": "conv1d_5913", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5912", 0, 0, {}]]]}, {"name": "conv1d_5916", "class_name": "Conv1D", "config": {"name": "conv1d_5916", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5915", 0, 0, {}]]]}, {"name": "max_pooling1d_5907", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5907", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5907", 0, 0, {}]]]}, {"name": "max_pooling1d_5910", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5910", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5910", 0, 0, {}]]]}, {"name": "max_pooling1d_5913", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5913", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5913", 0, 0, {}]]]}, {"name": "max_pooling1d_5916", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5916", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5916", 0, 0, {}]]]}, {"name": "flatten_1969", "class_name": "Flatten", "config": {"name": "flatten_1969", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5907", 0, 0, {}]]]}, {"name": "flatten_1970", "class_name": "Flatten", "config": {"name": "flatten_1970", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5910", 0, 0, {}]]]}, {"name": "flatten_1971", "class_name": "Flatten", "config": {"name": "flatten_1971", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5913", 0, 0, {}]]]}, {"name": "flatten_1972", "class_name": "Flatten", "config": {"name": "flatten_1972", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5916", 0, 0, {}]]]}, {"name": "concatenate_493", "class_name": "Concatenate", "config": {"name": "concatenate_493", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_1969", 0, 0, {}], ["flatten_1970", 0, 0, {}], ["flatten_1971", 0, 0, {}], ["flatten_1972", 0, 0, {}]]]}, {"name": "dense_985", "class_name": "Dense", "config": {"name": "dense_985", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_493", 0, 0, {}]]]}, {"name": "dense_986", "class_name": "Dense", "config": {"name": "dense_986", "trainable": true, "units": 2, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_985", 0, 0, {}]]]}], "input_layers": [["conv1d_5905_input", 0, 0], ["conv1d_5908_input", 0, 0], ["conv1d_5911_input", 0, 0], ["conv1d_5914_input", 0, 0]], "output_layers": [["dense_986", 0, 0]]}, "keras_version": "2.2.4", "backend": "theano"}