{"class_name": "Model", "config": {"name": "model_494", "layers": [{"name": "conv1d_5917_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5917_input"}, "inbound_nodes": []}, {"name": "conv1d_5920_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5920_input"}, "inbound_nodes": []}, {"name": "conv1d_5923_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5923_input"}, "inbound_nodes": []}, {"name": "conv1d_5926_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5926_input"}, "inbound_nodes": []}, {"name": "conv1d_5917", "class_name": "Conv1D", "config": {"name": "conv1d_5917", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5917_input", 0, 0, {}]]]}, {"name": "conv1d_5920", "class_name": "Conv1D", "config": {"name": "conv1d_5920", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5920_input", 0, 0, {}]]]}, {"name": "conv1d_5923", "class_name": "Conv1D", "config": {"name": "conv1d_5923", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5923_input", 0, 0, {}]]]}, {"name": "conv1d_5926", "class_name": "Conv1D", "config": {"name": "conv1d_5926", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5926_input", 0, 0, {}]]]}, {"name": "max_pooling1d_5917", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5917", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5917", 0, 0, {}]]]}, {"name": "max_pooling1d_5920", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5920", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5920", 0, 0, {}]]]}, {"name": "max_pooling1d_5923", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5923", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5923", 0, 0, {}]]]}, {"name": "max_pooling1d_5926", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5926", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5926", 0, 0, {}]]]}, {"name": "conv1d_5918", "class_name": "Conv1D", "config": {"name": "conv1d_5918", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5917", 0, 0, {}]]]}, {"name": "conv1d_5921", "class_name": "Conv1D", "config": {"name": "conv1d_5921", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5920", 0, 0, {}]]]}, {"name": "conv1d_5924", "class_name": "Conv1D", "config": {"name": "conv1d_5924", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5923", 0, 0, {}]]]}, {"name": "conv1d_5927", "class_name": "Conv1D", "config": {"name": "conv1d_5927", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5926", 0, 0, {}]]]}, {"name": "max_pooling1d_5918", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5918", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5918", 0, 0, {}]]]}, {"name": "max_pooling1d_5921", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5921", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5921", 0, 0, {}]]]}, {"name": "max_pooling1d_5924", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5924", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5924", 0, 0, {}]]]}, {"name": "max_pooling1d_5927", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5927", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5927", 0, 0, {}]]]}, {"name": "conv1d_5919", "class_name": "Conv1D", "config": {"name": "conv1d_5919", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5918", 0, 0, {}]]]}, {"name": "conv1d_5922", "class_name": "Conv1D", "config": {"name": "conv1d_5922", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5921", 0, 0, {}]]]}, {"name": "conv1d_5925", "class_name": "Conv1D", "config": {"name": "conv1d_5925", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5924", 0, 0, {}]]]}, {"name": "conv1d_5928", "class_name": "Conv1D", "config": {"name": "conv1d_5928", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5927", 0, 0, {}]]]}, {"name": "max_pooling1d_5919", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5919", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5919", 0, 0, {}]]]}, {"name": "max_pooling1d_5922", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5922", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5922", 0, 0, {}]]]}, {"name": "max_pooling1d_5925", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5925", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5925", 0, 0, {}]]]}, {"name": "max_pooling1d_5928", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5928", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5928", 0, 0, {}]]]}, {"name": "flatten_1973", "class_name": "Flatten", "config": {"name": "flatten_1973", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5919", 0, 0, {}]]]}, {"name": "flatten_1974", "class_name": "Flatten", "config": {"name": "flatten_1974", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5922", 0, 0, {}]]]}, {"name": "flatten_1975", "class_name": "Flatten", "config": {"name": "flatten_1975", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5925", 0, 0, {}]]]}, {"name": "flatten_1976", "class_name": "Flatten", "config": {"name": "flatten_1976", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5928", 0, 0, {}]]]}, {"name": "concatenate_494", "class_name": "Concatenate", "config": {"name": "concatenate_494", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_1973", 0, 0, {}], ["flatten_1974", 0, 0, {}], ["flatten_1975", 0, 0, {}], ["flatten_1976", 0, 0, {}]]]}, {"name": "dense_987", "class_name": "Dense", "config": {"name": "dense_987", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_494", 0, 0, {}]]]}, {"name": "dense_988", "class_name": "Dense", "config": {"name": "dense_988", "trainable": true, "units": 2, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_987", 0, 0, {}]]]}], "input_layers": [["conv1d_5917_input", 0, 0], ["conv1d_5920_input", 0, 0], ["conv1d_5923_input", 0, 0], ["conv1d_5926_input", 0, 0]], "output_layers": [["dense_988", 0, 0]]}, "keras_version": "2.2.4", "backend": "theano"}