{"class_name": "Model", "config": {"name": "model_499", "layers": [{"name": "conv1d_5977_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5977_input"}, "inbound_nodes": []}, {"name": "conv1d_5980_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5980_input"}, "inbound_nodes": []}, {"name": "conv1d_5983_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5983_input"}, "inbound_nodes": []}, {"name": "conv1d_5986_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5986_input"}, "inbound_nodes": []}, {"name": "conv1d_5977", "class_name": "Conv1D", "config": {"name": "conv1d_5977", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5977_input", 0, 0, {}]]]}, {"name": "conv1d_5980", "class_name": "Conv1D", "config": {"name": "conv1d_5980", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5980_input", 0, 0, {}]]]}, {"name": "conv1d_5983", "class_name": "Conv1D", "config": {"name": "conv1d_5983", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5983_input", 0, 0, {}]]]}, {"name": "conv1d_5986", "class_name": "Conv1D", "config": {"name": "conv1d_5986", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5986_input", 0, 0, {}]]]}, {"name": "max_pooling1d_5977", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5977", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5977", 0, 0, {}]]]}, {"name": "max_pooling1d_5980", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5980", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5980", 0, 0, {}]]]}, {"name": "max_pooling1d_5983", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5983", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5983", 0, 0, {}]]]}, {"name": "max_pooling1d_5986", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5986", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5986", 0, 0, {}]]]}, {"name": "conv1d_5978", "class_name": "Conv1D", "config": {"name": "conv1d_5978", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5977", 0, 0, {}]]]}, {"name": "conv1d_5981", "class_name": "Conv1D", "config": {"name": "conv1d_5981", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5980", 0, 0, {}]]]}, {"name": "conv1d_5984", "class_name": "Conv1D", "config": {"name": "conv1d_5984", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5983", 0, 0, {}]]]}, {"name": "conv1d_5987", "class_name": "Conv1D", "config": {"name": "conv1d_5987", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5986", 0, 0, {}]]]}, {"name": "max_pooling1d_5978", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5978", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5978", 0, 0, {}]]]}, {"name": "max_pooling1d_5981", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5981", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5981", 0, 0, {}]]]}, {"name": "max_pooling1d_5984", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5984", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5984", 0, 0, {}]]]}, {"name": "max_pooling1d_5987", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5987", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5987", 0, 0, {}]]]}, {"name": "conv1d_5979", "class_name": "Conv1D", "config": {"name": "conv1d_5979", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5978", 0, 0, {}]]]}, {"name": "conv1d_5982", "class_name": "Conv1D", "config": {"name": "conv1d_5982", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5981", 0, 0, {}]]]}, {"name": "conv1d_5985", "class_name": "Conv1D", "config": {"name": "conv1d_5985", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5984", 0, 0, {}]]]}, {"name": "conv1d_5988", "class_name": "Conv1D", "config": {"name": "conv1d_5988", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5987", 0, 0, {}]]]}, {"name": "max_pooling1d_5979", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5979", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5979", 0, 0, {}]]]}, {"name": "max_pooling1d_5982", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5982", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5982", 0, 0, {}]]]}, {"name": "max_pooling1d_5985", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5985", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5985", 0, 0, {}]]]}, {"name": "max_pooling1d_5988", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5988", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5988", 0, 0, {}]]]}, {"name": "flatten_1993", "class_name": "Flatten", "config": {"name": "flatten_1993", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5979", 0, 0, {}]]]}, {"name": "flatten_1994", "class_name": "Flatten", "config": {"name": "flatten_1994", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5982", 0, 0, {}]]]}, {"name": "flatten_1995", "class_name": "Flatten", "config": {"name": "flatten_1995", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5985", 0, 0, {}]]]}, {"name": "flatten_1996", "class_name": "Flatten", "config": {"name": "flatten_1996", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5988", 0, 0, {}]]]}, {"name": "concatenate_499", "class_name": "Concatenate", "config": {"name": "concatenate_499", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_1993", 0, 0, {}], ["flatten_1994", 0, 0, {}], ["flatten_1995", 0, 0, {}], ["flatten_1996", 0, 0, {}]]]}, {"name": "dense_997", "class_name": "Dense", "config": {"name": "dense_997", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_499", 0, 0, {}]]]}, {"name": "dense_998", "class_name": "Dense", "config": {"name": "dense_998", "trainable": true, "units": 2, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_997", 0, 0, {}]]]}], "input_layers": [["conv1d_5977_input", 0, 0], ["conv1d_5980_input", 0, 0], ["conv1d_5983_input", 0, 0], ["conv1d_5986_input", 0, 0]], "output_layers": [["dense_998", 0, 0]]}, "keras_version": "2.2.4", "backend": "theano"}