{"class_name": "Model", "config": {"name": "model_497", "layers": [{"name": "conv1d_5953_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5953_input"}, "inbound_nodes": []}, {"name": "conv1d_5956_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5956_input"}, "inbound_nodes": []}, {"name": "conv1d_5959_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5959_input"}, "inbound_nodes": []}, {"name": "conv1d_5962_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5962_input"}, "inbound_nodes": []}, {"name": "conv1d_5953", "class_name": "Conv1D", "config": {"name": "conv1d_5953", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5953_input", 0, 0, {}]]]}, {"name": "conv1d_5956", "class_name": "Conv1D", "config": {"name": "conv1d_5956", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5956_input", 0, 0, {}]]]}, {"name": "conv1d_5959", "class_name": "Conv1D", "config": {"name": "conv1d_5959", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5959_input", 0, 0, {}]]]}, {"name": "conv1d_5962", "class_name": "Conv1D", "config": {"name": "conv1d_5962", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5962_input", 0, 0, {}]]]}, {"name": "max_pooling1d_5953", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5953", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5953", 0, 0, {}]]]}, {"name": "max_pooling1d_5956", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5956", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5956", 0, 0, {}]]]}, {"name": "max_pooling1d_5959", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5959", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5959", 0, 0, {}]]]}, {"name": "max_pooling1d_5962", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5962", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5962", 0, 0, {}]]]}, {"name": "conv1d_5954", "class_name": "Conv1D", "config": {"name": "conv1d_5954", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5953", 0, 0, {}]]]}, {"name": "conv1d_5957", "class_name": "Conv1D", "config": {"name": "conv1d_5957", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5956", 0, 0, {}]]]}, {"name": "conv1d_5960", "class_name": "Conv1D", "config": {"name": "conv1d_5960", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5959", 0, 0, {}]]]}, {"name": "conv1d_5963", "class_name": "Conv1D", "config": {"name": "conv1d_5963", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5962", 0, 0, {}]]]}, {"name": "max_pooling1d_5954", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5954", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5954", 0, 0, {}]]]}, {"name": "max_pooling1d_5957", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5957", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5957", 0, 0, {}]]]}, {"name": "max_pooling1d_5960", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5960", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5960", 0, 0, {}]]]}, {"name": "max_pooling1d_5963", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5963", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5963", 0, 0, {}]]]}, {"name": "conv1d_5955", "class_name": "Conv1D", "config": {"name": "conv1d_5955", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5954", 0, 0, {}]]]}, {"name": "conv1d_5958", "class_name": "Conv1D", "config": {"name": "conv1d_5958", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5957", 0, 0, {}]]]}, {"name": "conv1d_5961", "class_name": "Conv1D", "config": {"name": "conv1d_5961", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5960", 0, 0, {}]]]}, {"name": "conv1d_5964", "class_name": "Conv1D", "config": {"name": "conv1d_5964", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5963", 0, 0, {}]]]}, {"name": "max_pooling1d_5955", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5955", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5955", 0, 0, {}]]]}, {"name": "max_pooling1d_5958", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5958", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5958", 0, 0, {}]]]}, {"name": "max_pooling1d_5961", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5961", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5961", 0, 0, {}]]]}, {"name": "max_pooling1d_5964", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5964", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5964", 0, 0, {}]]]}, {"name": "flatten_1985", "class_name": "Flatten", "config": {"name": "flatten_1985", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5955", 0, 0, {}]]]}, {"name": "flatten_1986", "class_name": "Flatten", "config": {"name": "flatten_1986", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5958", 0, 0, {}]]]}, {"name": "flatten_1987", "class_name": "Flatten", "config": {"name": "flatten_1987", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5961", 0, 0, {}]]]}, {"name": "flatten_1988", "class_name": "Flatten", "config": {"name": "flatten_1988", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5964", 0, 0, {}]]]}, {"name": "concatenate_497", "class_name": "Concatenate", "config": {"name": "concatenate_497", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_1985", 0, 0, {}], ["flatten_1986", 0, 0, {}], ["flatten_1987", 0, 0, {}], ["flatten_1988", 0, 0, {}]]]}, {"name": "dense_993", "class_name": "Dense", "config": {"name": "dense_993", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_497", 0, 0, {}]]]}, {"name": "dense_994", "class_name": "Dense", "config": {"name": "dense_994", "trainable": true, "units": 2, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_993", 0, 0, {}]]]}], "input_layers": [["conv1d_5953_input", 0, 0], ["conv1d_5956_input", 0, 0], ["conv1d_5959_input", 0, 0], ["conv1d_5962_input", 0, 0]], "output_layers": [["dense_994", 0, 0]]}, "keras_version": "2.2.4", "backend": "theano"}