{"class_name": "Model", "config": {"name": "model_500", "layers": [{"name": "conv1d_5989_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5989_input"}, "inbound_nodes": []}, {"name": "conv1d_5992_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5992_input"}, "inbound_nodes": []}, {"name": "conv1d_5995_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5995_input"}, "inbound_nodes": []}, {"name": "conv1d_5998_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5998_input"}, "inbound_nodes": []}, {"name": "conv1d_5989", "class_name": "Conv1D", "config": {"name": "conv1d_5989", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5989_input", 0, 0, {}]]]}, {"name": "conv1d_5992", "class_name": "Conv1D", "config": {"name": "conv1d_5992", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5992_input", 0, 0, {}]]]}, {"name": "conv1d_5995", "class_name": "Conv1D", "config": {"name": "conv1d_5995", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5995_input", 0, 0, {}]]]}, {"name": "conv1d_5998", "class_name": "Conv1D", "config": {"name": "conv1d_5998", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5998_input", 0, 0, {}]]]}, {"name": "max_pooling1d_5989", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5989", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5989", 0, 0, {}]]]}, {"name": "max_pooling1d_5992", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5992", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5992", 0, 0, {}]]]}, {"name": "max_pooling1d_5995", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5995", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5995", 0, 0, {}]]]}, {"name": "max_pooling1d_5998", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5998", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5998", 0, 0, {}]]]}, {"name": "conv1d_5990", "class_name": "Conv1D", "config": {"name": "conv1d_5990", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5989", 0, 0, {}]]]}, {"name": "conv1d_5993", "class_name": "Conv1D", "config": {"name": "conv1d_5993", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5992", 0, 0, {}]]]}, {"name": "conv1d_5996", "class_name": "Conv1D", "config": {"name": "conv1d_5996", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5995", 0, 0, {}]]]}, {"name": "conv1d_5999", "class_name": "Conv1D", "config": {"name": "conv1d_5999", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5998", 0, 0, {}]]]}, {"name": "max_pooling1d_5990", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5990", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5990", 0, 0, {}]]]}, {"name": "max_pooling1d_5993", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5993", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5993", 0, 0, {}]]]}, {"name": "max_pooling1d_5996", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5996", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5996", 0, 0, {}]]]}, {"name": "max_pooling1d_5999", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5999", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5999", 0, 0, {}]]]}, {"name": "conv1d_5991", "class_name": "Conv1D", "config": {"name": "conv1d_5991", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5990", 0, 0, {}]]]}, {"name": "conv1d_5994", "class_name": "Conv1D", "config": {"name": "conv1d_5994", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5993", 0, 0, {}]]]}, {"name": "conv1d_5997", "class_name": "Conv1D", "config": {"name": "conv1d_5997", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5996", 0, 0, {}]]]}, {"name": "conv1d_6000", "class_name": "Conv1D", "config": {"name": "conv1d_6000", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5999", 0, 0, {}]]]}, {"name": "max_pooling1d_5991", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5991", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5991", 0, 0, {}]]]}, {"name": "max_pooling1d_5994", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5994", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5994", 0, 0, {}]]]}, {"name": "max_pooling1d_5997", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5997", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5997", 0, 0, {}]]]}, {"name": "max_pooling1d_6000", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6000", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6000", 0, 0, {}]]]}, {"name": "flatten_1997", "class_name": "Flatten", "config": {"name": "flatten_1997", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5991", 0, 0, {}]]]}, {"name": "flatten_1998", "class_name": "Flatten", "config": {"name": "flatten_1998", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5994", 0, 0, {}]]]}, {"name": "flatten_1999", "class_name": "Flatten", "config": {"name": "flatten_1999", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5997", 0, 0, {}]]]}, {"name": "flatten_2000", "class_name": "Flatten", "config": {"name": "flatten_2000", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6000", 0, 0, {}]]]}, {"name": "concatenate_500", "class_name": "Concatenate", "config": {"name": "concatenate_500", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_1997", 0, 0, {}], ["flatten_1998", 0, 0, {}], ["flatten_1999", 0, 0, {}], ["flatten_2000", 0, 0, {}]]]}, {"name": "dense_999", "class_name": "Dense", "config": {"name": "dense_999", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_500", 0, 0, {}]]]}, {"name": "dense_1000", "class_name": "Dense", "config": {"name": "dense_1000", "trainable": true, "units": 2, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_999", 0, 0, {}]]]}], "input_layers": [["conv1d_5989_input", 0, 0], ["conv1d_5992_input", 0, 0], ["conv1d_5995_input", 0, 0], ["conv1d_5998_input", 0, 0]], "output_layers": [["dense_1000", 0, 0]]}, "keras_version": "2.2.4", "backend": "theano"}