{"class_name": "Model", "config": {"name": "model_498", "layers": [{"name": "conv1d_5965_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5965_input"}, "inbound_nodes": []}, {"name": "conv1d_5968_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5968_input"}, "inbound_nodes": []}, {"name": "conv1d_5971_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5971_input"}, "inbound_nodes": []}, {"name": "conv1d_5974_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5974_input"}, "inbound_nodes": []}, {"name": "conv1d_5965", "class_name": "Conv1D", "config": {"name": "conv1d_5965", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5965_input", 0, 0, {}]]]}, {"name": "conv1d_5968", "class_name": "Conv1D", "config": {"name": "conv1d_5968", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5968_input", 0, 0, {}]]]}, {"name": "conv1d_5971", "class_name": "Conv1D", "config": {"name": "conv1d_5971", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5971_input", 0, 0, {}]]]}, {"name": "conv1d_5974", "class_name": "Conv1D", "config": {"name": "conv1d_5974", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5974_input", 0, 0, {}]]]}, {"name": "max_pooling1d_5965", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5965", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5965", 0, 0, {}]]]}, {"name": "max_pooling1d_5968", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5968", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5968", 0, 0, {}]]]}, {"name": "max_pooling1d_5971", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5971", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5971", 0, 0, {}]]]}, {"name": "max_pooling1d_5974", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5974", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5974", 0, 0, {}]]]}, {"name": "conv1d_5966", "class_name": "Conv1D", "config": {"name": "conv1d_5966", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5965", 0, 0, {}]]]}, {"name": "conv1d_5969", "class_name": "Conv1D", "config": {"name": "conv1d_5969", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5968", 0, 0, {}]]]}, {"name": "conv1d_5972", "class_name": "Conv1D", "config": {"name": "conv1d_5972", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5971", 0, 0, {}]]]}, {"name": "conv1d_5975", "class_name": "Conv1D", "config": {"name": "conv1d_5975", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5974", 0, 0, {}]]]}, {"name": "max_pooling1d_5966", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5966", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5966", 0, 0, {}]]]}, {"name": "max_pooling1d_5969", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5969", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5969", 0, 0, {}]]]}, {"name": "max_pooling1d_5972", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5972", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5972", 0, 0, {}]]]}, {"name": "max_pooling1d_5975", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5975", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5975", 0, 0, {}]]]}, {"name": "conv1d_5967", "class_name": "Conv1D", "config": {"name": "conv1d_5967", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5966", 0, 0, {}]]]}, {"name": "conv1d_5970", "class_name": "Conv1D", "config": {"name": "conv1d_5970", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5969", 0, 0, {}]]]}, {"name": "conv1d_5973", "class_name": "Conv1D", "config": {"name": "conv1d_5973", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5972", 0, 0, {}]]]}, {"name": "conv1d_5976", "class_name": "Conv1D", "config": {"name": "conv1d_5976", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5975", 0, 0, {}]]]}, {"name": "max_pooling1d_5967", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5967", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5967", 0, 0, {}]]]}, {"name": "max_pooling1d_5970", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5970", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5970", 0, 0, {}]]]}, {"name": "max_pooling1d_5973", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5973", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5973", 0, 0, {}]]]}, {"name": "max_pooling1d_5976", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5976", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5976", 0, 0, {}]]]}, {"name": "flatten_1989", "class_name": "Flatten", "config": {"name": "flatten_1989", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5967", 0, 0, {}]]]}, {"name": "flatten_1990", "class_name": "Flatten", "config": {"name": "flatten_1990", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5970", 0, 0, {}]]]}, {"name": "flatten_1991", "class_name": "Flatten", "config": {"name": "flatten_1991", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5973", 0, 0, {}]]]}, {"name": "flatten_1992", "class_name": "Flatten", "config": {"name": "flatten_1992", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5976", 0, 0, {}]]]}, {"name": "concatenate_498", "class_name": "Concatenate", "config": {"name": "concatenate_498", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_1989", 0, 0, {}], ["flatten_1990", 0, 0, {}], ["flatten_1991", 0, 0, {}], ["flatten_1992", 0, 0, {}]]]}, {"name": "dense_995", "class_name": "Dense", "config": {"name": "dense_995", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_498", 0, 0, {}]]]}, {"name": "dense_996", "class_name": "Dense", "config": {"name": "dense_996", "trainable": true, "units": 2, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_995", 0, 0, {}]]]}], "input_layers": [["conv1d_5965_input", 0, 0], ["conv1d_5968_input", 0, 0], ["conv1d_5971_input", 0, 0], ["conv1d_5974_input", 0, 0]], "output_layers": [["dense_996", 0, 0]]}, "keras_version": "2.2.4", "backend": "theano"}