{"class_name": "Model", "config": {"name": "model_496", "layers": [{"name": "conv1d_5941_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5941_input"}, "inbound_nodes": []}, {"name": "conv1d_5944_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5944_input"}, "inbound_nodes": []}, {"name": "conv1d_5947_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5947_input"}, "inbound_nodes": []}, {"name": "conv1d_5950_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5950_input"}, "inbound_nodes": []}, {"name": "conv1d_5941", "class_name": "Conv1D", "config": {"name": "conv1d_5941", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5941_input", 0, 0, {}]]]}, {"name": "conv1d_5944", "class_name": "Conv1D", "config": {"name": "conv1d_5944", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5944_input", 0, 0, {}]]]}, {"name": "conv1d_5947", "class_name": "Conv1D", "config": {"name": "conv1d_5947", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5947_input", 0, 0, {}]]]}, {"name": "conv1d_5950", "class_name": "Conv1D", "config": {"name": "conv1d_5950", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5950_input", 0, 0, {}]]]}, {"name": "max_pooling1d_5941", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5941", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5941", 0, 0, {}]]]}, {"name": "max_pooling1d_5944", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5944", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5944", 0, 0, {}]]]}, {"name": "max_pooling1d_5947", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5947", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5947", 0, 0, {}]]]}, {"name": "max_pooling1d_5950", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5950", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5950", 0, 0, {}]]]}, {"name": "conv1d_5942", "class_name": "Conv1D", "config": {"name": "conv1d_5942", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5941", 0, 0, {}]]]}, {"name": "conv1d_5945", "class_name": "Conv1D", "config": {"name": "conv1d_5945", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5944", 0, 0, {}]]]}, {"name": "conv1d_5948", "class_name": "Conv1D", "config": {"name": "conv1d_5948", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5947", 0, 0, {}]]]}, {"name": "conv1d_5951", "class_name": "Conv1D", "config": {"name": "conv1d_5951", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5950", 0, 0, {}]]]}, {"name": "max_pooling1d_5942", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5942", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5942", 0, 0, {}]]]}, {"name": "max_pooling1d_5945", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5945", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5945", 0, 0, {}]]]}, {"name": "max_pooling1d_5948", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5948", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5948", 0, 0, {}]]]}, {"name": "max_pooling1d_5951", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5951", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5951", 0, 0, {}]]]}, {"name": "conv1d_5943", "class_name": "Conv1D", "config": {"name": "conv1d_5943", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5942", 0, 0, {}]]]}, {"name": "conv1d_5946", "class_name": "Conv1D", "config": {"name": "conv1d_5946", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5945", 0, 0, {}]]]}, {"name": "conv1d_5949", "class_name": "Conv1D", "config": {"name": "conv1d_5949", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5948", 0, 0, {}]]]}, {"name": "conv1d_5952", "class_name": "Conv1D", "config": {"name": "conv1d_5952", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5951", 0, 0, {}]]]}, {"name": "max_pooling1d_5943", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5943", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5943", 0, 0, {}]]]}, {"name": "max_pooling1d_5946", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5946", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5946", 0, 0, {}]]]}, {"name": "max_pooling1d_5949", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5949", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5949", 0, 0, {}]]]}, {"name": "max_pooling1d_5952", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5952", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5952", 0, 0, {}]]]}, {"name": "flatten_1981", "class_name": "Flatten", "config": {"name": "flatten_1981", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5943", 0, 0, {}]]]}, {"name": "flatten_1982", "class_name": "Flatten", "config": {"name": "flatten_1982", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5946", 0, 0, {}]]]}, {"name": "flatten_1983", "class_name": "Flatten", "config": {"name": "flatten_1983", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5949", 0, 0, {}]]]}, {"name": "flatten_1984", "class_name": "Flatten", "config": {"name": "flatten_1984", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5952", 0, 0, {}]]]}, {"name": "concatenate_496", "class_name": "Concatenate", "config": {"name": "concatenate_496", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_1981", 0, 0, {}], ["flatten_1982", 0, 0, {}], ["flatten_1983", 0, 0, {}], ["flatten_1984", 0, 0, {}]]]}, {"name": "dense_991", "class_name": "Dense", "config": {"name": "dense_991", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_496", 0, 0, {}]]]}, {"name": "dense_992", "class_name": "Dense", "config": {"name": "dense_992", "trainable": true, "units": 2, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_991", 0, 0, {}]]]}], "input_layers": [["conv1d_5941_input", 0, 0], ["conv1d_5944_input", 0, 0], ["conv1d_5947_input", 0, 0], ["conv1d_5950_input", 0, 0]], "output_layers": [["dense_992", 0, 0]]}, "keras_version": "2.2.4", "backend": "theano"}