{"class_name": "Model", "config": {"name": "model_504", "layers": [{"name": "conv1d_6037_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6037_input"}, "inbound_nodes": []}, {"name": "conv1d_6040_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6040_input"}, "inbound_nodes": []}, {"name": "conv1d_6043_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6043_input"}, "inbound_nodes": []}, {"name": "conv1d_6046_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6046_input"}, "inbound_nodes": []}, {"name": "conv1d_6037", "class_name": "Conv1D", "config": {"name": "conv1d_6037", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6037_input", 0, 0, {}]]]}, {"name": "conv1d_6040", "class_name": "Conv1D", "config": {"name": "conv1d_6040", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6040_input", 0, 0, {}]]]}, {"name": "conv1d_6043", "class_name": "Conv1D", "config": {"name": "conv1d_6043", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6043_input", 0, 0, {}]]]}, {"name": "conv1d_6046", "class_name": "Conv1D", "config": {"name": "conv1d_6046", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6046_input", 0, 0, {}]]]}, {"name": "max_pooling1d_6037", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6037", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6037", 0, 0, {}]]]}, {"name": "max_pooling1d_6040", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6040", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6040", 0, 0, {}]]]}, {"name": "max_pooling1d_6043", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6043", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6043", 0, 0, {}]]]}, {"name": "max_pooling1d_6046", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6046", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6046", 0, 0, {}]]]}, {"name": "conv1d_6038", "class_name": "Conv1D", "config": {"name": "conv1d_6038", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6037", 0, 0, {}]]]}, {"name": "conv1d_6041", "class_name": "Conv1D", "config": {"name": "conv1d_6041", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6040", 0, 0, {}]]]}, {"name": "conv1d_6044", "class_name": "Conv1D", "config": {"name": "conv1d_6044", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6043", 0, 0, {}]]]}, {"name": "conv1d_6047", "class_name": "Conv1D", "config": {"name": "conv1d_6047", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6046", 0, 0, {}]]]}, {"name": "max_pooling1d_6038", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6038", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6038", 0, 0, {}]]]}, {"name": "max_pooling1d_6041", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6041", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6041", 0, 0, {}]]]}, {"name": "max_pooling1d_6044", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6044", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6044", 0, 0, {}]]]}, {"name": "max_pooling1d_6047", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6047", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6047", 0, 0, {}]]]}, {"name": "conv1d_6039", "class_name": "Conv1D", "config": {"name": "conv1d_6039", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6038", 0, 0, {}]]]}, {"name": "conv1d_6042", "class_name": "Conv1D", "config": {"name": "conv1d_6042", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6041", 0, 0, {}]]]}, {"name": "conv1d_6045", "class_name": "Conv1D", "config": {"name": "conv1d_6045", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6044", 0, 0, {}]]]}, {"name": "conv1d_6048", "class_name": "Conv1D", "config": {"name": "conv1d_6048", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6047", 0, 0, {}]]]}, {"name": "max_pooling1d_6039", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6039", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6039", 0, 0, {}]]]}, {"name": "max_pooling1d_6042", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6042", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6042", 0, 0, {}]]]}, {"name": "max_pooling1d_6045", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6045", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6045", 0, 0, {}]]]}, {"name": "max_pooling1d_6048", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6048", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6048", 0, 0, {}]]]}, {"name": "flatten_2013", "class_name": "Flatten", "config": {"name": "flatten_2013", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6039", 0, 0, {}]]]}, {"name": "flatten_2014", "class_name": "Flatten", "config": {"name": "flatten_2014", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6042", 0, 0, {}]]]}, {"name": "flatten_2015", "class_name": "Flatten", "config": {"name": "flatten_2015", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6045", 0, 0, {}]]]}, {"name": "flatten_2016", "class_name": "Flatten", "config": {"name": "flatten_2016", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6048", 0, 0, {}]]]}, {"name": "concatenate_504", "class_name": "Concatenate", "config": {"name": "concatenate_504", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_2013", 0, 0, {}], ["flatten_2014", 0, 0, {}], ["flatten_2015", 0, 0, {}], ["flatten_2016", 0, 0, {}]]]}, {"name": "dense_1007", "class_name": "Dense", "config": {"name": "dense_1007", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_504", 0, 0, {}]]]}, {"name": "dense_1008", "class_name": "Dense", "config": {"name": "dense_1008", "trainable": true, "units": 2, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_1007", 0, 0, {}]]]}], "input_layers": [["conv1d_6037_input", 0, 0], ["conv1d_6040_input", 0, 0], ["conv1d_6043_input", 0, 0], ["conv1d_6046_input", 0, 0]], "output_layers": [["dense_1008", 0, 0]]}, "keras_version": "2.2.4", "backend": "theano"}