{"class_name": "Model", "config": {"name": "model_505", "layers": [{"name": "conv1d_6049_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6049_input"}, "inbound_nodes": []}, {"name": "conv1d_6052_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6052_input"}, "inbound_nodes": []}, {"name": "conv1d_6055_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6055_input"}, "inbound_nodes": []}, {"name": "conv1d_6058_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6058_input"}, "inbound_nodes": []}, {"name": "conv1d_6049", "class_name": "Conv1D", "config": {"name": "conv1d_6049", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6049_input", 0, 0, {}]]]}, {"name": "conv1d_6052", "class_name": "Conv1D", "config": {"name": "conv1d_6052", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6052_input", 0, 0, {}]]]}, {"name": "conv1d_6055", "class_name": "Conv1D", "config": {"name": "conv1d_6055", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6055_input", 0, 0, {}]]]}, {"name": "conv1d_6058", "class_name": "Conv1D", "config": {"name": "conv1d_6058", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6058_input", 0, 0, {}]]]}, {"name": "max_pooling1d_6049", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6049", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6049", 0, 0, {}]]]}, {"name": "max_pooling1d_6052", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6052", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6052", 0, 0, {}]]]}, {"name": "max_pooling1d_6055", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6055", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6055", 0, 0, {}]]]}, {"name": "max_pooling1d_6058", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6058", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6058", 0, 0, {}]]]}, {"name": "conv1d_6050", "class_name": "Conv1D", "config": {"name": "conv1d_6050", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6049", 0, 0, {}]]]}, {"name": "conv1d_6053", "class_name": "Conv1D", "config": {"name": "conv1d_6053", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6052", 0, 0, {}]]]}, {"name": "conv1d_6056", "class_name": "Conv1D", "config": {"name": "conv1d_6056", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6055", 0, 0, {}]]]}, {"name": "conv1d_6059", "class_name": "Conv1D", "config": {"name": "conv1d_6059", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6058", 0, 0, {}]]]}, {"name": "max_pooling1d_6050", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6050", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6050", 0, 0, {}]]]}, {"name": "max_pooling1d_6053", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6053", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6053", 0, 0, {}]]]}, {"name": "max_pooling1d_6056", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6056", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6056", 0, 0, {}]]]}, {"name": "max_pooling1d_6059", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6059", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6059", 0, 0, {}]]]}, {"name": "conv1d_6051", "class_name": "Conv1D", "config": {"name": "conv1d_6051", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6050", 0, 0, {}]]]}, {"name": "conv1d_6054", "class_name": "Conv1D", "config": {"name": "conv1d_6054", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6053", 0, 0, {}]]]}, {"name": "conv1d_6057", "class_name": "Conv1D", "config": {"name": "conv1d_6057", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6056", 0, 0, {}]]]}, {"name": "conv1d_6060", "class_name": "Conv1D", "config": {"name": "conv1d_6060", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6059", 0, 0, {}]]]}, {"name": "max_pooling1d_6051", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6051", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6051", 0, 0, {}]]]}, {"name": "max_pooling1d_6054", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6054", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6054", 0, 0, {}]]]}, {"name": "max_pooling1d_6057", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6057", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6057", 0, 0, {}]]]}, {"name": "max_pooling1d_6060", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6060", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6060", 0, 0, {}]]]}, {"name": "flatten_2017", "class_name": "Flatten", "config": {"name": "flatten_2017", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6051", 0, 0, {}]]]}, {"name": "flatten_2018", "class_name": "Flatten", "config": {"name": "flatten_2018", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6054", 0, 0, {}]]]}, {"name": "flatten_2019", "class_name": "Flatten", "config": {"name": "flatten_2019", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6057", 0, 0, {}]]]}, {"name": "flatten_2020", "class_name": "Flatten", "config": {"name": "flatten_2020", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6060", 0, 0, {}]]]}, {"name": "concatenate_505", "class_name": "Concatenate", "config": {"name": "concatenate_505", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_2017", 0, 0, {}], ["flatten_2018", 0, 0, {}], ["flatten_2019", 0, 0, {}], ["flatten_2020", 0, 0, {}]]]}, {"name": "dense_1009", "class_name": "Dense", "config": {"name": "dense_1009", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_505", 0, 0, {}]]]}, {"name": "dense_1010", "class_name": "Dense", "config": {"name": "dense_1010", "trainable": true, "units": 2, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_1009", 0, 0, {}]]]}], "input_layers": [["conv1d_6049_input", 0, 0], ["conv1d_6052_input", 0, 0], ["conv1d_6055_input", 0, 0], ["conv1d_6058_input", 0, 0]], "output_layers": [["dense_1010", 0, 0]]}, "keras_version": "2.2.4", "backend": "theano"}