{"class_name": "Model", "config": {"name": "model_503", "layers": [{"name": "conv1d_6025_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6025_input"}, "inbound_nodes": []}, {"name": "conv1d_6028_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6028_input"}, "inbound_nodes": []}, {"name": "conv1d_6031_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6031_input"}, "inbound_nodes": []}, {"name": "conv1d_6034_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6034_input"}, "inbound_nodes": []}, {"name": "conv1d_6025", "class_name": "Conv1D", "config": {"name": "conv1d_6025", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6025_input", 0, 0, {}]]]}, {"name": "conv1d_6028", "class_name": "Conv1D", "config": {"name": "conv1d_6028", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6028_input", 0, 0, {}]]]}, {"name": "conv1d_6031", "class_name": "Conv1D", "config": {"name": "conv1d_6031", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6031_input", 0, 0, {}]]]}, {"name": "conv1d_6034", "class_name": "Conv1D", "config": {"name": "conv1d_6034", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6034_input", 0, 0, {}]]]}, {"name": "max_pooling1d_6025", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6025", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6025", 0, 0, {}]]]}, {"name": "max_pooling1d_6028", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6028", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6028", 0, 0, {}]]]}, {"name": "max_pooling1d_6031", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6031", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6031", 0, 0, {}]]]}, {"name": "max_pooling1d_6034", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6034", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6034", 0, 0, {}]]]}, {"name": "conv1d_6026", "class_name": "Conv1D", "config": {"name": "conv1d_6026", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6025", 0, 0, {}]]]}, {"name": "conv1d_6029", "class_name": "Conv1D", "config": {"name": "conv1d_6029", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6028", 0, 0, {}]]]}, {"name": "conv1d_6032", "class_name": "Conv1D", "config": {"name": "conv1d_6032", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6031", 0, 0, {}]]]}, {"name": "conv1d_6035", "class_name": "Conv1D", "config": {"name": "conv1d_6035", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6034", 0, 0, {}]]]}, {"name": "max_pooling1d_6026", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6026", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6026", 0, 0, {}]]]}, {"name": "max_pooling1d_6029", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6029", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6029", 0, 0, {}]]]}, {"name": "max_pooling1d_6032", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6032", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6032", 0, 0, {}]]]}, {"name": "max_pooling1d_6035", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6035", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6035", 0, 0, {}]]]}, {"name": "conv1d_6027", "class_name": "Conv1D", "config": {"name": "conv1d_6027", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6026", 0, 0, {}]]]}, {"name": "conv1d_6030", "class_name": "Conv1D", "config": {"name": "conv1d_6030", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6029", 0, 0, {}]]]}, {"name": "conv1d_6033", "class_name": "Conv1D", "config": {"name": "conv1d_6033", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6032", 0, 0, {}]]]}, {"name": "conv1d_6036", "class_name": "Conv1D", "config": {"name": "conv1d_6036", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6035", 0, 0, {}]]]}, {"name": "max_pooling1d_6027", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6027", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6027", 0, 0, {}]]]}, {"name": "max_pooling1d_6030", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6030", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6030", 0, 0, {}]]]}, {"name": "max_pooling1d_6033", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6033", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6033", 0, 0, {}]]]}, {"name": "max_pooling1d_6036", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6036", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6036", 0, 0, {}]]]}, {"name": "flatten_2009", "class_name": "Flatten", "config": {"name": "flatten_2009", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6027", 0, 0, {}]]]}, {"name": "flatten_2010", "class_name": "Flatten", "config": {"name": "flatten_2010", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6030", 0, 0, {}]]]}, {"name": "flatten_2011", "class_name": "Flatten", "config": {"name": "flatten_2011", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6033", 0, 0, {}]]]}, {"name": "flatten_2012", "class_name": "Flatten", "config": {"name": "flatten_2012", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6036", 0, 0, {}]]]}, {"name": "concatenate_503", "class_name": "Concatenate", "config": {"name": "concatenate_503", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_2009", 0, 0, {}], ["flatten_2010", 0, 0, {}], ["flatten_2011", 0, 0, {}], ["flatten_2012", 0, 0, {}]]]}, {"name": "dense_1005", "class_name": "Dense", "config": {"name": "dense_1005", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_503", 0, 0, {}]]]}, {"name": "dense_1006", "class_name": "Dense", "config": {"name": "dense_1006", "trainable": true, "units": 2, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_1005", 0, 0, {}]]]}], "input_layers": [["conv1d_6025_input", 0, 0], ["conv1d_6028_input", 0, 0], ["conv1d_6031_input", 0, 0], ["conv1d_6034_input", 0, 0]], "output_layers": [["dense_1006", 0, 0]]}, "keras_version": "2.2.4", "backend": "theano"}