{"class_name": "Model", "config": {"name": "model_502", "layers": [{"name": "conv1d_6013_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6013_input"}, "inbound_nodes": []}, {"name": "conv1d_6016_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6016_input"}, "inbound_nodes": []}, {"name": "conv1d_6019_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6019_input"}, "inbound_nodes": []}, {"name": "conv1d_6022_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6022_input"}, "inbound_nodes": []}, {"name": "conv1d_6013", "class_name": "Conv1D", "config": {"name": "conv1d_6013", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6013_input", 0, 0, {}]]]}, {"name": "conv1d_6016", "class_name": "Conv1D", "config": {"name": "conv1d_6016", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6016_input", 0, 0, {}]]]}, {"name": "conv1d_6019", "class_name": "Conv1D", "config": {"name": "conv1d_6019", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6019_input", 0, 0, {}]]]}, {"name": "conv1d_6022", "class_name": "Conv1D", "config": {"name": "conv1d_6022", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6022_input", 0, 0, {}]]]}, {"name": "max_pooling1d_6013", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6013", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6013", 0, 0, {}]]]}, {"name": "max_pooling1d_6016", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6016", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6016", 0, 0, {}]]]}, {"name": "max_pooling1d_6019", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6019", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6019", 0, 0, {}]]]}, {"name": "max_pooling1d_6022", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6022", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6022", 0, 0, {}]]]}, {"name": "conv1d_6014", "class_name": "Conv1D", "config": {"name": "conv1d_6014", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6013", 0, 0, {}]]]}, {"name": "conv1d_6017", "class_name": "Conv1D", "config": {"name": "conv1d_6017", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6016", 0, 0, {}]]]}, {"name": "conv1d_6020", "class_name": "Conv1D", "config": {"name": "conv1d_6020", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6019", 0, 0, {}]]]}, {"name": "conv1d_6023", "class_name": "Conv1D", "config": {"name": "conv1d_6023", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6022", 0, 0, {}]]]}, {"name": "max_pooling1d_6014", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6014", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6014", 0, 0, {}]]]}, {"name": "max_pooling1d_6017", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6017", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6017", 0, 0, {}]]]}, {"name": "max_pooling1d_6020", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6020", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6020", 0, 0, {}]]]}, {"name": "max_pooling1d_6023", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6023", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6023", 0, 0, {}]]]}, {"name": "conv1d_6015", "class_name": "Conv1D", "config": {"name": "conv1d_6015", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6014", 0, 0, {}]]]}, {"name": "conv1d_6018", "class_name": "Conv1D", "config": {"name": "conv1d_6018", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6017", 0, 0, {}]]]}, {"name": "conv1d_6021", "class_name": "Conv1D", "config": {"name": "conv1d_6021", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6020", 0, 0, {}]]]}, {"name": "conv1d_6024", "class_name": "Conv1D", "config": {"name": "conv1d_6024", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6023", 0, 0, {}]]]}, {"name": "max_pooling1d_6015", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6015", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6015", 0, 0, {}]]]}, {"name": "max_pooling1d_6018", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6018", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6018", 0, 0, {}]]]}, {"name": "max_pooling1d_6021", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6021", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6021", 0, 0, {}]]]}, {"name": "max_pooling1d_6024", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6024", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6024", 0, 0, {}]]]}, {"name": "flatten_2005", "class_name": "Flatten", "config": {"name": "flatten_2005", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6015", 0, 0, {}]]]}, {"name": "flatten_2006", "class_name": "Flatten", "config": {"name": "flatten_2006", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6018", 0, 0, {}]]]}, {"name": "flatten_2007", "class_name": "Flatten", "config": {"name": "flatten_2007", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6021", 0, 0, {}]]]}, {"name": "flatten_2008", "class_name": "Flatten", "config": {"name": "flatten_2008", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6024", 0, 0, {}]]]}, {"name": "concatenate_502", "class_name": "Concatenate", "config": {"name": "concatenate_502", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_2005", 0, 0, {}], ["flatten_2006", 0, 0, {}], ["flatten_2007", 0, 0, {}], ["flatten_2008", 0, 0, {}]]]}, {"name": "dense_1003", "class_name": "Dense", "config": {"name": "dense_1003", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_502", 0, 0, {}]]]}, {"name": "dense_1004", "class_name": "Dense", "config": {"name": "dense_1004", "trainable": true, "units": 2, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_1003", 0, 0, {}]]]}], "input_layers": [["conv1d_6013_input", 0, 0], ["conv1d_6016_input", 0, 0], ["conv1d_6019_input", 0, 0], ["conv1d_6022_input", 0, 0]], "output_layers": [["dense_1004", 0, 0]]}, "keras_version": "2.2.4", "backend": "theano"}