{"class_name": "Model", "config": {"name": "model_501", "layers": [{"name": "conv1d_6001_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6001_input"}, "inbound_nodes": []}, {"name": "conv1d_6004_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6004_input"}, "inbound_nodes": []}, {"name": "conv1d_6007_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6007_input"}, "inbound_nodes": []}, {"name": "conv1d_6010_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6010_input"}, "inbound_nodes": []}, {"name": "conv1d_6001", "class_name": "Conv1D", "config": {"name": "conv1d_6001", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6001_input", 0, 0, {}]]]}, {"name": "conv1d_6004", "class_name": "Conv1D", "config": {"name": "conv1d_6004", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6004_input", 0, 0, {}]]]}, {"name": "conv1d_6007", "class_name": "Conv1D", "config": {"name": "conv1d_6007", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6007_input", 0, 0, {}]]]}, {"name": "conv1d_6010", "class_name": "Conv1D", "config": {"name": "conv1d_6010", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6010_input", 0, 0, {}]]]}, {"name": "max_pooling1d_6001", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6001", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6001", 0, 0, {}]]]}, {"name": "max_pooling1d_6004", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6004", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6004", 0, 0, {}]]]}, {"name": "max_pooling1d_6007", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6007", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6007", 0, 0, {}]]]}, {"name": "max_pooling1d_6010", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6010", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6010", 0, 0, {}]]]}, {"name": "conv1d_6002", "class_name": "Conv1D", "config": {"name": "conv1d_6002", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6001", 0, 0, {}]]]}, {"name": "conv1d_6005", "class_name": "Conv1D", "config": {"name": "conv1d_6005", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6004", 0, 0, {}]]]}, {"name": "conv1d_6008", "class_name": "Conv1D", "config": {"name": "conv1d_6008", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6007", 0, 0, {}]]]}, {"name": "conv1d_6011", "class_name": "Conv1D", "config": {"name": "conv1d_6011", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6010", 0, 0, {}]]]}, {"name": "max_pooling1d_6002", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6002", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6002", 0, 0, {}]]]}, {"name": "max_pooling1d_6005", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6005", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6005", 0, 0, {}]]]}, {"name": "max_pooling1d_6008", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6008", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6008", 0, 0, {}]]]}, {"name": "max_pooling1d_6011", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6011", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6011", 0, 0, {}]]]}, {"name": "conv1d_6003", "class_name": "Conv1D", "config": {"name": "conv1d_6003", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6002", 0, 0, {}]]]}, {"name": "conv1d_6006", "class_name": "Conv1D", "config": {"name": "conv1d_6006", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6005", 0, 0, {}]]]}, {"name": "conv1d_6009", "class_name": "Conv1D", "config": {"name": "conv1d_6009", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6008", 0, 0, {}]]]}, {"name": "conv1d_6012", "class_name": "Conv1D", "config": {"name": "conv1d_6012", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6011", 0, 0, {}]]]}, {"name": "max_pooling1d_6003", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6003", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6003", 0, 0, {}]]]}, {"name": "max_pooling1d_6006", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6006", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6006", 0, 0, {}]]]}, {"name": "max_pooling1d_6009", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6009", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6009", 0, 0, {}]]]}, {"name": "max_pooling1d_6012", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6012", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6012", 0, 0, {}]]]}, {"name": "flatten_2001", "class_name": "Flatten", "config": {"name": "flatten_2001", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6003", 0, 0, {}]]]}, {"name": "flatten_2002", "class_name": "Flatten", "config": {"name": "flatten_2002", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6006", 0, 0, {}]]]}, {"name": "flatten_2003", "class_name": "Flatten", "config": {"name": "flatten_2003", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6009", 0, 0, {}]]]}, {"name": "flatten_2004", "class_name": "Flatten", "config": {"name": "flatten_2004", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6012", 0, 0, {}]]]}, {"name": "concatenate_501", "class_name": "Concatenate", "config": {"name": "concatenate_501", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_2001", 0, 0, {}], ["flatten_2002", 0, 0, {}], ["flatten_2003", 0, 0, {}], ["flatten_2004", 0, 0, {}]]]}, {"name": "dense_1001", "class_name": "Dense", "config": {"name": "dense_1001", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_501", 0, 0, {}]]]}, {"name": "dense_1002", "class_name": "Dense", "config": {"name": "dense_1002", "trainable": true, "units": 2, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_1001", 0, 0, {}]]]}], "input_layers": [["conv1d_6001_input", 0, 0], ["conv1d_6004_input", 0, 0], ["conv1d_6007_input", 0, 0], ["conv1d_6010_input", 0, 0]], "output_layers": [["dense_1002", 0, 0]]}, "keras_version": "2.2.4", "backend": "theano"}