{"class_name": "Model", "config": {"name": "model_510", "layers": [{"name": "conv1d_6109_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6109_input"}, "inbound_nodes": []}, {"name": "conv1d_6112_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6112_input"}, "inbound_nodes": []}, {"name": "conv1d_6115_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6115_input"}, "inbound_nodes": []}, {"name": "conv1d_6118_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6118_input"}, "inbound_nodes": []}, {"name": "conv1d_6109", "class_name": "Conv1D", "config": {"name": "conv1d_6109", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6109_input", 0, 0, {}]]]}, {"name": "conv1d_6112", "class_name": "Conv1D", "config": {"name": "conv1d_6112", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6112_input", 0, 0, {}]]]}, {"name": "conv1d_6115", "class_name": "Conv1D", "config": {"name": "conv1d_6115", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6115_input", 0, 0, {}]]]}, {"name": "conv1d_6118", "class_name": "Conv1D", "config": {"name": "conv1d_6118", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6118_input", 0, 0, {}]]]}, {"name": "max_pooling1d_6109", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6109", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6109", 0, 0, {}]]]}, {"name": "max_pooling1d_6112", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6112", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6112", 0, 0, {}]]]}, {"name": "max_pooling1d_6115", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6115", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6115", 0, 0, {}]]]}, {"name": "max_pooling1d_6118", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6118", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6118", 0, 0, {}]]]}, {"name": "conv1d_6110", "class_name": "Conv1D", "config": {"name": "conv1d_6110", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6109", 0, 0, {}]]]}, {"name": "conv1d_6113", "class_name": "Conv1D", "config": {"name": "conv1d_6113", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6112", 0, 0, {}]]]}, {"name": "conv1d_6116", "class_name": "Conv1D", "config": {"name": "conv1d_6116", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6115", 0, 0, {}]]]}, {"name": "conv1d_6119", "class_name": "Conv1D", "config": {"name": "conv1d_6119", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6118", 0, 0, {}]]]}, {"name": "max_pooling1d_6110", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6110", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6110", 0, 0, {}]]]}, {"name": "max_pooling1d_6113", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6113", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6113", 0, 0, {}]]]}, {"name": "max_pooling1d_6116", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6116", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6116", 0, 0, {}]]]}, {"name": "max_pooling1d_6119", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6119", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6119", 0, 0, {}]]]}, {"name": "conv1d_6111", "class_name": "Conv1D", "config": {"name": "conv1d_6111", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6110", 0, 0, {}]]]}, {"name": "conv1d_6114", "class_name": "Conv1D", "config": {"name": "conv1d_6114", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6113", 0, 0, {}]]]}, {"name": "conv1d_6117", "class_name": "Conv1D", "config": {"name": "conv1d_6117", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6116", 0, 0, {}]]]}, {"name": "conv1d_6120", "class_name": "Conv1D", "config": {"name": "conv1d_6120", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6119", 0, 0, {}]]]}, {"name": "max_pooling1d_6111", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6111", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6111", 0, 0, {}]]]}, {"name": "max_pooling1d_6114", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6114", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6114", 0, 0, {}]]]}, {"name": "max_pooling1d_6117", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6117", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6117", 0, 0, {}]]]}, {"name": "max_pooling1d_6120", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6120", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6120", 0, 0, {}]]]}, {"name": "flatten_2037", "class_name": "Flatten", "config": {"name": "flatten_2037", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6111", 0, 0, {}]]]}, {"name": "flatten_2038", "class_name": "Flatten", "config": {"name": "flatten_2038", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6114", 0, 0, {}]]]}, {"name": "flatten_2039", "class_name": "Flatten", "config": {"name": "flatten_2039", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6117", 0, 0, {}]]]}, {"name": "flatten_2040", "class_name": "Flatten", "config": {"name": "flatten_2040", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6120", 0, 0, {}]]]}, {"name": "concatenate_510", "class_name": "Concatenate", "config": {"name": "concatenate_510", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_2037", 0, 0, {}], ["flatten_2038", 0, 0, {}], ["flatten_2039", 0, 0, {}], ["flatten_2040", 0, 0, {}]]]}, {"name": "dense_1019", "class_name": "Dense", "config": {"name": "dense_1019", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_510", 0, 0, {}]]]}, {"name": "dense_1020", "class_name": "Dense", "config": {"name": "dense_1020", "trainable": true, "units": 2, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_1019", 0, 0, {}]]]}], "input_layers": [["conv1d_6109_input", 0, 0], ["conv1d_6112_input", 0, 0], ["conv1d_6115_input", 0, 0], ["conv1d_6118_input", 0, 0]], "output_layers": [["dense_1020", 0, 0]]}, "keras_version": "2.2.4", "backend": "theano"}