{"class_name": "Model", "config": {"name": "model_506", "layers": [{"name": "conv1d_6061_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6061_input"}, "inbound_nodes": []}, {"name": "conv1d_6064_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6064_input"}, "inbound_nodes": []}, {"name": "conv1d_6067_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6067_input"}, "inbound_nodes": []}, {"name": "conv1d_6070_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6070_input"}, "inbound_nodes": []}, {"name": "conv1d_6061", "class_name": "Conv1D", "config": {"name": "conv1d_6061", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6061_input", 0, 0, {}]]]}, {"name": "conv1d_6064", "class_name": "Conv1D", "config": {"name": "conv1d_6064", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6064_input", 0, 0, {}]]]}, {"name": "conv1d_6067", "class_name": "Conv1D", "config": {"name": "conv1d_6067", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6067_input", 0, 0, {}]]]}, {"name": "conv1d_6070", "class_name": "Conv1D", "config": {"name": "conv1d_6070", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6070_input", 0, 0, {}]]]}, {"name": "max_pooling1d_6061", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6061", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6061", 0, 0, {}]]]}, {"name": "max_pooling1d_6064", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6064", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6064", 0, 0, {}]]]}, {"name": "max_pooling1d_6067", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6067", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6067", 0, 0, {}]]]}, {"name": "max_pooling1d_6070", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6070", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6070", 0, 0, {}]]]}, {"name": "conv1d_6062", "class_name": "Conv1D", "config": {"name": "conv1d_6062", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6061", 0, 0, {}]]]}, {"name": "conv1d_6065", "class_name": "Conv1D", "config": {"name": "conv1d_6065", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6064", 0, 0, {}]]]}, {"name": "conv1d_6068", "class_name": "Conv1D", "config": {"name": "conv1d_6068", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6067", 0, 0, {}]]]}, {"name": "conv1d_6071", "class_name": "Conv1D", "config": {"name": "conv1d_6071", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6070", 0, 0, {}]]]}, {"name": "max_pooling1d_6062", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6062", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6062", 0, 0, {}]]]}, {"name": "max_pooling1d_6065", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6065", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6065", 0, 0, {}]]]}, {"name": "max_pooling1d_6068", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6068", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6068", 0, 0, {}]]]}, {"name": "max_pooling1d_6071", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6071", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6071", 0, 0, {}]]]}, {"name": "conv1d_6063", "class_name": "Conv1D", "config": {"name": "conv1d_6063", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6062", 0, 0, {}]]]}, {"name": "conv1d_6066", "class_name": "Conv1D", "config": {"name": "conv1d_6066", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6065", 0, 0, {}]]]}, {"name": "conv1d_6069", "class_name": "Conv1D", "config": {"name": "conv1d_6069", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6068", 0, 0, {}]]]}, {"name": "conv1d_6072", "class_name": "Conv1D", "config": {"name": "conv1d_6072", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6071", 0, 0, {}]]]}, {"name": "max_pooling1d_6063", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6063", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6063", 0, 0, {}]]]}, {"name": "max_pooling1d_6066", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6066", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6066", 0, 0, {}]]]}, {"name": "max_pooling1d_6069", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6069", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6069", 0, 0, {}]]]}, {"name": "max_pooling1d_6072", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6072", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6072", 0, 0, {}]]]}, {"name": "flatten_2021", "class_name": "Flatten", "config": {"name": "flatten_2021", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6063", 0, 0, {}]]]}, {"name": "flatten_2022", "class_name": "Flatten", "config": {"name": "flatten_2022", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6066", 0, 0, {}]]]}, {"name": "flatten_2023", "class_name": "Flatten", "config": {"name": "flatten_2023", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6069", 0, 0, {}]]]}, {"name": "flatten_2024", "class_name": "Flatten", "config": {"name": "flatten_2024", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6072", 0, 0, {}]]]}, {"name": "concatenate_506", "class_name": "Concatenate", "config": {"name": "concatenate_506", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_2021", 0, 0, {}], ["flatten_2022", 0, 0, {}], ["flatten_2023", 0, 0, {}], ["flatten_2024", 0, 0, {}]]]}, {"name": "dense_1011", "class_name": "Dense", "config": {"name": "dense_1011", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_506", 0, 0, {}]]]}, {"name": "dense_1012", "class_name": "Dense", "config": {"name": "dense_1012", "trainable": true, "units": 2, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_1011", 0, 0, {}]]]}], "input_layers": [["conv1d_6061_input", 0, 0], ["conv1d_6064_input", 0, 0], ["conv1d_6067_input", 0, 0], ["conv1d_6070_input", 0, 0]], "output_layers": [["dense_1012", 0, 0]]}, "keras_version": "2.2.4", "backend": "theano"}