{"class_name": "Model", "config": {"name": "model_508", "layers": [{"name": "conv1d_6085_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6085_input"}, "inbound_nodes": []}, {"name": "conv1d_6088_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6088_input"}, "inbound_nodes": []}, {"name": "conv1d_6091_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6091_input"}, "inbound_nodes": []}, {"name": "conv1d_6094_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6094_input"}, "inbound_nodes": []}, {"name": "conv1d_6085", "class_name": "Conv1D", "config": {"name": "conv1d_6085", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6085_input", 0, 0, {}]]]}, {"name": "conv1d_6088", "class_name": "Conv1D", "config": {"name": "conv1d_6088", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6088_input", 0, 0, {}]]]}, {"name": "conv1d_6091", "class_name": "Conv1D", "config": {"name": "conv1d_6091", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6091_input", 0, 0, {}]]]}, {"name": "conv1d_6094", "class_name": "Conv1D", "config": {"name": "conv1d_6094", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6094_input", 0, 0, {}]]]}, {"name": "max_pooling1d_6085", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6085", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6085", 0, 0, {}]]]}, {"name": "max_pooling1d_6088", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6088", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6088", 0, 0, {}]]]}, {"name": "max_pooling1d_6091", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6091", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6091", 0, 0, {}]]]}, {"name": "max_pooling1d_6094", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6094", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6094", 0, 0, {}]]]}, {"name": "conv1d_6086", "class_name": "Conv1D", "config": {"name": "conv1d_6086", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6085", 0, 0, {}]]]}, {"name": "conv1d_6089", "class_name": "Conv1D", "config": {"name": "conv1d_6089", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6088", 0, 0, {}]]]}, {"name": "conv1d_6092", "class_name": "Conv1D", "config": {"name": "conv1d_6092", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6091", 0, 0, {}]]]}, {"name": "conv1d_6095", "class_name": "Conv1D", "config": {"name": "conv1d_6095", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6094", 0, 0, {}]]]}, {"name": "max_pooling1d_6086", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6086", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6086", 0, 0, {}]]]}, {"name": "max_pooling1d_6089", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6089", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6089", 0, 0, {}]]]}, {"name": "max_pooling1d_6092", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6092", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6092", 0, 0, {}]]]}, {"name": "max_pooling1d_6095", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6095", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6095", 0, 0, {}]]]}, {"name": "conv1d_6087", "class_name": "Conv1D", "config": {"name": "conv1d_6087", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6086", 0, 0, {}]]]}, {"name": "conv1d_6090", "class_name": "Conv1D", "config": {"name": "conv1d_6090", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6089", 0, 0, {}]]]}, {"name": "conv1d_6093", "class_name": "Conv1D", "config": {"name": "conv1d_6093", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6092", 0, 0, {}]]]}, {"name": "conv1d_6096", "class_name": "Conv1D", "config": {"name": "conv1d_6096", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6095", 0, 0, {}]]]}, {"name": "max_pooling1d_6087", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6087", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6087", 0, 0, {}]]]}, {"name": "max_pooling1d_6090", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6090", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6090", 0, 0, {}]]]}, {"name": "max_pooling1d_6093", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6093", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6093", 0, 0, {}]]]}, {"name": "max_pooling1d_6096", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6096", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6096", 0, 0, {}]]]}, {"name": "flatten_2029", "class_name": "Flatten", "config": {"name": "flatten_2029", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6087", 0, 0, {}]]]}, {"name": "flatten_2030", "class_name": "Flatten", "config": {"name": "flatten_2030", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6090", 0, 0, {}]]]}, {"name": "flatten_2031", "class_name": "Flatten", "config": {"name": "flatten_2031", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6093", 0, 0, {}]]]}, {"name": "flatten_2032", "class_name": "Flatten", "config": {"name": "flatten_2032", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6096", 0, 0, {}]]]}, {"name": "concatenate_508", "class_name": "Concatenate", "config": {"name": "concatenate_508", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_2029", 0, 0, {}], ["flatten_2030", 0, 0, {}], ["flatten_2031", 0, 0, {}], ["flatten_2032", 0, 0, {}]]]}, {"name": "dense_1015", "class_name": "Dense", "config": {"name": "dense_1015", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_508", 0, 0, {}]]]}, {"name": "dense_1016", "class_name": "Dense", "config": {"name": "dense_1016", "trainable": true, "units": 2, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_1015", 0, 0, {}]]]}], "input_layers": [["conv1d_6085_input", 0, 0], ["conv1d_6088_input", 0, 0], ["conv1d_6091_input", 0, 0], ["conv1d_6094_input", 0, 0]], "output_layers": [["dense_1016", 0, 0]]}, "keras_version": "2.2.4", "backend": "theano"}