{"class_name": "Model", "config": {"name": "model_509", "layers": [{"name": "conv1d_6097_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6097_input"}, "inbound_nodes": []}, {"name": "conv1d_6100_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6100_input"}, "inbound_nodes": []}, {"name": "conv1d_6103_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6103_input"}, "inbound_nodes": []}, {"name": "conv1d_6106_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6106_input"}, "inbound_nodes": []}, {"name": "conv1d_6097", "class_name": "Conv1D", "config": {"name": "conv1d_6097", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6097_input", 0, 0, {}]]]}, {"name": "conv1d_6100", "class_name": "Conv1D", "config": {"name": "conv1d_6100", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6100_input", 0, 0, {}]]]}, {"name": "conv1d_6103", "class_name": "Conv1D", "config": {"name": "conv1d_6103", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6103_input", 0, 0, {}]]]}, {"name": "conv1d_6106", "class_name": "Conv1D", "config": {"name": "conv1d_6106", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6106_input", 0, 0, {}]]]}, {"name": "max_pooling1d_6097", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6097", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6097", 0, 0, {}]]]}, {"name": "max_pooling1d_6100", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6100", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6100", 0, 0, {}]]]}, {"name": "max_pooling1d_6103", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6103", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6103", 0, 0, {}]]]}, {"name": "max_pooling1d_6106", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6106", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6106", 0, 0, {}]]]}, {"name": "conv1d_6098", "class_name": "Conv1D", "config": {"name": "conv1d_6098", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6097", 0, 0, {}]]]}, {"name": "conv1d_6101", "class_name": "Conv1D", "config": {"name": "conv1d_6101", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6100", 0, 0, {}]]]}, {"name": "conv1d_6104", "class_name": "Conv1D", "config": {"name": "conv1d_6104", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6103", 0, 0, {}]]]}, {"name": "conv1d_6107", "class_name": "Conv1D", "config": {"name": "conv1d_6107", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6106", 0, 0, {}]]]}, {"name": "max_pooling1d_6098", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6098", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6098", 0, 0, {}]]]}, {"name": "max_pooling1d_6101", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6101", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6101", 0, 0, {}]]]}, {"name": "max_pooling1d_6104", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6104", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6104", 0, 0, {}]]]}, {"name": "max_pooling1d_6107", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6107", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6107", 0, 0, {}]]]}, {"name": "conv1d_6099", "class_name": "Conv1D", "config": {"name": "conv1d_6099", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6098", 0, 0, {}]]]}, {"name": "conv1d_6102", "class_name": "Conv1D", "config": {"name": "conv1d_6102", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6101", 0, 0, {}]]]}, {"name": "conv1d_6105", "class_name": "Conv1D", "config": {"name": "conv1d_6105", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6104", 0, 0, {}]]]}, {"name": "conv1d_6108", "class_name": "Conv1D", "config": {"name": "conv1d_6108", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6107", 0, 0, {}]]]}, {"name": "max_pooling1d_6099", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6099", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6099", 0, 0, {}]]]}, {"name": "max_pooling1d_6102", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6102", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6102", 0, 0, {}]]]}, {"name": "max_pooling1d_6105", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6105", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6105", 0, 0, {}]]]}, {"name": "max_pooling1d_6108", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6108", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6108", 0, 0, {}]]]}, {"name": "flatten_2033", "class_name": "Flatten", "config": {"name": "flatten_2033", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6099", 0, 0, {}]]]}, {"name": "flatten_2034", "class_name": "Flatten", "config": {"name": "flatten_2034", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6102", 0, 0, {}]]]}, {"name": "flatten_2035", "class_name": "Flatten", "config": {"name": "flatten_2035", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6105", 0, 0, {}]]]}, {"name": "flatten_2036", "class_name": "Flatten", "config": {"name": "flatten_2036", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6108", 0, 0, {}]]]}, {"name": "concatenate_509", "class_name": "Concatenate", "config": {"name": "concatenate_509", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_2033", 0, 0, {}], ["flatten_2034", 0, 0, {}], ["flatten_2035", 0, 0, {}], ["flatten_2036", 0, 0, {}]]]}, {"name": "dense_1017", "class_name": "Dense", "config": {"name": "dense_1017", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_509", 0, 0, {}]]]}, {"name": "dense_1018", "class_name": "Dense", "config": {"name": "dense_1018", "trainable": true, "units": 2, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_1017", 0, 0, {}]]]}], "input_layers": [["conv1d_6097_input", 0, 0], ["conv1d_6100_input", 0, 0], ["conv1d_6103_input", 0, 0], ["conv1d_6106_input", 0, 0]], "output_layers": [["dense_1018", 0, 0]]}, "keras_version": "2.2.4", "backend": "theano"}