{"class_name": "Model", "config": {"name": "model_507", "layers": [{"name": "conv1d_6073_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6073_input"}, "inbound_nodes": []}, {"name": "conv1d_6076_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6076_input"}, "inbound_nodes": []}, {"name": "conv1d_6079_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6079_input"}, "inbound_nodes": []}, {"name": "conv1d_6082_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6082_input"}, "inbound_nodes": []}, {"name": "conv1d_6073", "class_name": "Conv1D", "config": {"name": "conv1d_6073", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6073_input", 0, 0, {}]]]}, {"name": "conv1d_6076", "class_name": "Conv1D", "config": {"name": "conv1d_6076", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6076_input", 0, 0, {}]]]}, {"name": "conv1d_6079", "class_name": "Conv1D", "config": {"name": "conv1d_6079", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6079_input", 0, 0, {}]]]}, {"name": "conv1d_6082", "class_name": "Conv1D", "config": {"name": "conv1d_6082", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6082_input", 0, 0, {}]]]}, {"name": "max_pooling1d_6073", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6073", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6073", 0, 0, {}]]]}, {"name": "max_pooling1d_6076", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6076", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6076", 0, 0, {}]]]}, {"name": "max_pooling1d_6079", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6079", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6079", 0, 0, {}]]]}, {"name": "max_pooling1d_6082", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6082", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6082", 0, 0, {}]]]}, {"name": "conv1d_6074", "class_name": "Conv1D", "config": {"name": "conv1d_6074", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6073", 0, 0, {}]]]}, {"name": "conv1d_6077", "class_name": "Conv1D", "config": {"name": "conv1d_6077", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6076", 0, 0, {}]]]}, {"name": "conv1d_6080", "class_name": "Conv1D", "config": {"name": "conv1d_6080", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6079", 0, 0, {}]]]}, {"name": "conv1d_6083", "class_name": "Conv1D", "config": {"name": "conv1d_6083", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6082", 0, 0, {}]]]}, {"name": "max_pooling1d_6074", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6074", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6074", 0, 0, {}]]]}, {"name": "max_pooling1d_6077", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6077", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6077", 0, 0, {}]]]}, {"name": "max_pooling1d_6080", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6080", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6080", 0, 0, {}]]]}, {"name": "max_pooling1d_6083", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6083", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6083", 0, 0, {}]]]}, {"name": "conv1d_6075", "class_name": "Conv1D", "config": {"name": "conv1d_6075", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6074", 0, 0, {}]]]}, {"name": "conv1d_6078", "class_name": "Conv1D", "config": {"name": "conv1d_6078", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6077", 0, 0, {}]]]}, {"name": "conv1d_6081", "class_name": "Conv1D", "config": {"name": "conv1d_6081", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6080", 0, 0, {}]]]}, {"name": "conv1d_6084", "class_name": "Conv1D", "config": {"name": "conv1d_6084", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6083", 0, 0, {}]]]}, {"name": "max_pooling1d_6075", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6075", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6075", 0, 0, {}]]]}, {"name": "max_pooling1d_6078", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6078", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6078", 0, 0, {}]]]}, {"name": "max_pooling1d_6081", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6081", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6081", 0, 0, {}]]]}, {"name": "max_pooling1d_6084", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6084", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6084", 0, 0, {}]]]}, {"name": "flatten_2025", "class_name": "Flatten", "config": {"name": "flatten_2025", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6075", 0, 0, {}]]]}, {"name": "flatten_2026", "class_name": "Flatten", "config": {"name": "flatten_2026", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6078", 0, 0, {}]]]}, {"name": "flatten_2027", "class_name": "Flatten", "config": {"name": "flatten_2027", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6081", 0, 0, {}]]]}, {"name": "flatten_2028", "class_name": "Flatten", "config": {"name": "flatten_2028", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6084", 0, 0, {}]]]}, {"name": "concatenate_507", "class_name": "Concatenate", "config": {"name": "concatenate_507", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_2025", 0, 0, {}], ["flatten_2026", 0, 0, {}], ["flatten_2027", 0, 0, {}], ["flatten_2028", 0, 0, {}]]]}, {"name": "dense_1013", "class_name": "Dense", "config": {"name": "dense_1013", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_507", 0, 0, {}]]]}, {"name": "dense_1014", "class_name": "Dense", "config": {"name": "dense_1014", "trainable": true, "units": 2, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_1013", 0, 0, {}]]]}], "input_layers": [["conv1d_6073_input", 0, 0], ["conv1d_6076_input", 0, 0], ["conv1d_6079_input", 0, 0], ["conv1d_6082_input", 0, 0]], "output_layers": [["dense_1014", 0, 0]]}, "keras_version": "2.2.4", "backend": "theano"}