{"class_name": "Model", "config": {"name": "model_480", "layers": [{"name": "conv1d_5749_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5749_input"}, "inbound_nodes": []}, {"name": "conv1d_5752_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5752_input"}, "inbound_nodes": []}, {"name": "conv1d_5755_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5755_input"}, "inbound_nodes": []}, {"name": "conv1d_5758_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5758_input"}, "inbound_nodes": []}, {"name": "conv1d_5749", "class_name": "Conv1D", "config": {"name": "conv1d_5749", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5749_input", 0, 0, {}]]]}, {"name": "conv1d_5752", "class_name": "Conv1D", "config": {"name": "conv1d_5752", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5752_input", 0, 0, {}]]]}, {"name": "conv1d_5755", "class_name": "Conv1D", "config": {"name": "conv1d_5755", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5755_input", 0, 0, {}]]]}, {"name": "conv1d_5758", "class_name": "Conv1D", "config": {"name": "conv1d_5758", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5758_input", 0, 0, {}]]]}, {"name": "max_pooling1d_5749", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5749", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5749", 0, 0, {}]]]}, {"name": "max_pooling1d_5752", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5752", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5752", 0, 0, {}]]]}, {"name": "max_pooling1d_5755", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5755", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5755", 0, 0, {}]]]}, {"name": "max_pooling1d_5758", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5758", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5758", 0, 0, {}]]]}, {"name": "conv1d_5750", "class_name": "Conv1D", "config": {"name": "conv1d_5750", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5749", 0, 0, {}]]]}, {"name": "conv1d_5753", "class_name": "Conv1D", "config": {"name": "conv1d_5753", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5752", 0, 0, {}]]]}, {"name": "conv1d_5756", "class_name": "Conv1D", "config": {"name": "conv1d_5756", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5755", 0, 0, {}]]]}, {"name": "conv1d_5759", "class_name": "Conv1D", "config": {"name": "conv1d_5759", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5758", 0, 0, {}]]]}, {"name": "max_pooling1d_5750", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5750", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5750", 0, 0, {}]]]}, {"name": "max_pooling1d_5753", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5753", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5753", 0, 0, {}]]]}, {"name": "max_pooling1d_5756", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5756", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5756", 0, 0, {}]]]}, {"name": "max_pooling1d_5759", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5759", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5759", 0, 0, {}]]]}, {"name": "conv1d_5751", "class_name": "Conv1D", "config": {"name": "conv1d_5751", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5750", 0, 0, {}]]]}, {"name": "conv1d_5754", "class_name": "Conv1D", "config": {"name": "conv1d_5754", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5753", 0, 0, {}]]]}, {"name": "conv1d_5757", "class_name": "Conv1D", "config": {"name": "conv1d_5757", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5756", 0, 0, {}]]]}, {"name": "conv1d_5760", "class_name": "Conv1D", "config": {"name": "conv1d_5760", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5759", 0, 0, {}]]]}, {"name": "max_pooling1d_5751", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5751", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5751", 0, 0, {}]]]}, {"name": "max_pooling1d_5754", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5754", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5754", 0, 0, {}]]]}, {"name": "max_pooling1d_5757", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5757", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5757", 0, 0, {}]]]}, {"name": "max_pooling1d_5760", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5760", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5760", 0, 0, {}]]]}, {"name": "flatten_1917", "class_name": "Flatten", "config": {"name": "flatten_1917", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5751", 0, 0, {}]]]}, {"name": "flatten_1918", "class_name": "Flatten", "config": {"name": "flatten_1918", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5754", 0, 0, {}]]]}, {"name": "flatten_1919", "class_name": "Flatten", "config": {"name": "flatten_1919", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5757", 0, 0, {}]]]}, {"name": "flatten_1920", "class_name": "Flatten", "config": {"name": "flatten_1920", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5760", 0, 0, {}]]]}, {"name": "concatenate_480", "class_name": "Concatenate", "config": {"name": "concatenate_480", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_1917", 0, 0, {}], ["flatten_1918", 0, 0, {}], ["flatten_1919", 0, 0, {}], ["flatten_1920", 0, 0, {}]]]}, {"name": "dense_959", "class_name": "Dense", "config": {"name": "dense_959", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_480", 0, 0, {}]]]}, {"name": "dense_960", "class_name": "Dense", "config": {"name": "dense_960", "trainable": true, "units": 2, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_959", 0, 0, {}]]]}], "input_layers": [["conv1d_5749_input", 0, 0], ["conv1d_5752_input", 0, 0], ["conv1d_5755_input", 0, 0], ["conv1d_5758_input", 0, 0]], "output_layers": [["dense_960", 0, 0]]}, "keras_version": "2.2.4", "backend": "theano"}