{"class_name": "Model", "config": {"name": "model_513", "layers": [{"name": "conv1d_6145_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6145_input"}, "inbound_nodes": []}, {"name": "conv1d_6148_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6148_input"}, "inbound_nodes": []}, {"name": "conv1d_6151_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6151_input"}, "inbound_nodes": []}, {"name": "conv1d_6154_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6154_input"}, "inbound_nodes": []}, {"name": "conv1d_6145", "class_name": "Conv1D", "config": {"name": "conv1d_6145", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6145_input", 0, 0, {}]]]}, {"name": "conv1d_6148", "class_name": "Conv1D", "config": {"name": "conv1d_6148", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6148_input", 0, 0, {}]]]}, {"name": "conv1d_6151", "class_name": "Conv1D", "config": {"name": "conv1d_6151", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6151_input", 0, 0, {}]]]}, {"name": "conv1d_6154", "class_name": "Conv1D", "config": {"name": "conv1d_6154", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6154_input", 0, 0, {}]]]}, {"name": "max_pooling1d_6145", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6145", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6145", 0, 0, {}]]]}, {"name": "max_pooling1d_6148", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6148", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6148", 0, 0, {}]]]}, {"name": "max_pooling1d_6151", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6151", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6151", 0, 0, {}]]]}, {"name": "max_pooling1d_6154", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6154", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6154", 0, 0, {}]]]}, {"name": "conv1d_6146", "class_name": "Conv1D", "config": {"name": "conv1d_6146", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6145", 0, 0, {}]]]}, {"name": "conv1d_6149", "class_name": "Conv1D", "config": {"name": "conv1d_6149", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6148", 0, 0, {}]]]}, {"name": "conv1d_6152", "class_name": "Conv1D", "config": {"name": "conv1d_6152", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6151", 0, 0, {}]]]}, {"name": "conv1d_6155", "class_name": "Conv1D", "config": {"name": "conv1d_6155", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6154", 0, 0, {}]]]}, {"name": "max_pooling1d_6146", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6146", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6146", 0, 0, {}]]]}, {"name": "max_pooling1d_6149", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6149", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6149", 0, 0, {}]]]}, {"name": "max_pooling1d_6152", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6152", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6152", 0, 0, {}]]]}, {"name": "max_pooling1d_6155", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6155", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6155", 0, 0, {}]]]}, {"name": "conv1d_6147", "class_name": "Conv1D", "config": {"name": "conv1d_6147", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6146", 0, 0, {}]]]}, {"name": "conv1d_6150", "class_name": "Conv1D", "config": {"name": "conv1d_6150", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6149", 0, 0, {}]]]}, {"name": "conv1d_6153", "class_name": "Conv1D", "config": {"name": "conv1d_6153", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6152", 0, 0, {}]]]}, {"name": "conv1d_6156", "class_name": "Conv1D", "config": {"name": "conv1d_6156", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6155", 0, 0, {}]]]}, {"name": "max_pooling1d_6147", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6147", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6147", 0, 0, {}]]]}, {"name": "max_pooling1d_6150", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6150", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6150", 0, 0, {}]]]}, {"name": "max_pooling1d_6153", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6153", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6153", 0, 0, {}]]]}, {"name": "max_pooling1d_6156", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6156", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6156", 0, 0, {}]]]}, {"name": "flatten_2049", "class_name": "Flatten", "config": {"name": "flatten_2049", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6147", 0, 0, {}]]]}, {"name": "flatten_2050", "class_name": "Flatten", "config": {"name": "flatten_2050", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6150", 0, 0, {}]]]}, {"name": "flatten_2051", "class_name": "Flatten", "config": {"name": "flatten_2051", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6153", 0, 0, {}]]]}, {"name": "flatten_2052", "class_name": "Flatten", "config": {"name": "flatten_2052", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6156", 0, 0, {}]]]}, {"name": "concatenate_513", "class_name": "Concatenate", "config": {"name": "concatenate_513", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_2049", 0, 0, {}], ["flatten_2050", 0, 0, {}], ["flatten_2051", 0, 0, {}], ["flatten_2052", 0, 0, {}]]]}, {"name": "dense_1025", "class_name": "Dense", "config": {"name": "dense_1025", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_513", 0, 0, {}]]]}, {"name": "dense_1026", "class_name": "Dense", "config": {"name": "dense_1026", "trainable": true, "units": 2, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_1025", 0, 0, {}]]]}], "input_layers": [["conv1d_6145_input", 0, 0], ["conv1d_6148_input", 0, 0], ["conv1d_6151_input", 0, 0], ["conv1d_6154_input", 0, 0]], "output_layers": [["dense_1026", 0, 0]]}, "keras_version": "2.2.4", "backend": "theano"}