{"class_name": "Model", "config": {"name": "model_511", "layers": [{"name": "conv1d_6121_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6121_input"}, "inbound_nodes": []}, {"name": "conv1d_6124_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6124_input"}, "inbound_nodes": []}, {"name": "conv1d_6127_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6127_input"}, "inbound_nodes": []}, {"name": "conv1d_6130_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6130_input"}, "inbound_nodes": []}, {"name": "conv1d_6121", "class_name": "Conv1D", "config": {"name": "conv1d_6121", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6121_input", 0, 0, {}]]]}, {"name": "conv1d_6124", "class_name": "Conv1D", "config": {"name": "conv1d_6124", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6124_input", 0, 0, {}]]]}, {"name": "conv1d_6127", "class_name": "Conv1D", "config": {"name": "conv1d_6127", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6127_input", 0, 0, {}]]]}, {"name": "conv1d_6130", "class_name": "Conv1D", "config": {"name": "conv1d_6130", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6130_input", 0, 0, {}]]]}, {"name": "max_pooling1d_6121", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6121", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6121", 0, 0, {}]]]}, {"name": "max_pooling1d_6124", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6124", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6124", 0, 0, {}]]]}, {"name": "max_pooling1d_6127", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6127", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6127", 0, 0, {}]]]}, {"name": "max_pooling1d_6130", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6130", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6130", 0, 0, {}]]]}, {"name": "conv1d_6122", "class_name": "Conv1D", "config": {"name": "conv1d_6122", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6121", 0, 0, {}]]]}, {"name": "conv1d_6125", "class_name": "Conv1D", "config": {"name": "conv1d_6125", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6124", 0, 0, {}]]]}, {"name": "conv1d_6128", "class_name": "Conv1D", "config": {"name": "conv1d_6128", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6127", 0, 0, {}]]]}, {"name": "conv1d_6131", "class_name": "Conv1D", "config": {"name": "conv1d_6131", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6130", 0, 0, {}]]]}, {"name": "max_pooling1d_6122", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6122", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6122", 0, 0, {}]]]}, {"name": "max_pooling1d_6125", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6125", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6125", 0, 0, {}]]]}, {"name": "max_pooling1d_6128", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6128", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6128", 0, 0, {}]]]}, {"name": "max_pooling1d_6131", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6131", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6131", 0, 0, {}]]]}, {"name": "conv1d_6123", "class_name": "Conv1D", "config": {"name": "conv1d_6123", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6122", 0, 0, {}]]]}, {"name": "conv1d_6126", "class_name": "Conv1D", "config": {"name": "conv1d_6126", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6125", 0, 0, {}]]]}, {"name": "conv1d_6129", "class_name": "Conv1D", "config": {"name": "conv1d_6129", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6128", 0, 0, {}]]]}, {"name": "conv1d_6132", "class_name": "Conv1D", "config": {"name": "conv1d_6132", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6131", 0, 0, {}]]]}, {"name": "max_pooling1d_6123", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6123", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6123", 0, 0, {}]]]}, {"name": "max_pooling1d_6126", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6126", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6126", 0, 0, {}]]]}, {"name": "max_pooling1d_6129", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6129", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6129", 0, 0, {}]]]}, {"name": "max_pooling1d_6132", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6132", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6132", 0, 0, {}]]]}, {"name": "flatten_2041", "class_name": "Flatten", "config": {"name": "flatten_2041", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6123", 0, 0, {}]]]}, {"name": "flatten_2042", "class_name": "Flatten", "config": {"name": "flatten_2042", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6126", 0, 0, {}]]]}, {"name": "flatten_2043", "class_name": "Flatten", "config": {"name": "flatten_2043", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6129", 0, 0, {}]]]}, {"name": "flatten_2044", "class_name": "Flatten", "config": {"name": "flatten_2044", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6132", 0, 0, {}]]]}, {"name": "concatenate_511", "class_name": "Concatenate", "config": {"name": "concatenate_511", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_2041", 0, 0, {}], ["flatten_2042", 0, 0, {}], ["flatten_2043", 0, 0, {}], ["flatten_2044", 0, 0, {}]]]}, {"name": "dense_1021", "class_name": "Dense", "config": {"name": "dense_1021", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_511", 0, 0, {}]]]}, {"name": "dense_1022", "class_name": "Dense", "config": {"name": "dense_1022", "trainable": true, "units": 2, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_1021", 0, 0, {}]]]}], "input_layers": [["conv1d_6121_input", 0, 0], ["conv1d_6124_input", 0, 0], ["conv1d_6127_input", 0, 0], ["conv1d_6130_input", 0, 0]], "output_layers": [["dense_1022", 0, 0]]}, "keras_version": "2.2.4", "backend": "theano"}