{"class_name": "Model", "config": {"name": "model_512", "layers": [{"name": "conv1d_6133_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6133_input"}, "inbound_nodes": []}, {"name": "conv1d_6136_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6136_input"}, "inbound_nodes": []}, {"name": "conv1d_6139_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6139_input"}, "inbound_nodes": []}, {"name": "conv1d_6142_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6142_input"}, "inbound_nodes": []}, {"name": "conv1d_6133", "class_name": "Conv1D", "config": {"name": "conv1d_6133", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6133_input", 0, 0, {}]]]}, {"name": "conv1d_6136", "class_name": "Conv1D", "config": {"name": "conv1d_6136", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6136_input", 0, 0, {}]]]}, {"name": "conv1d_6139", "class_name": "Conv1D", "config": {"name": "conv1d_6139", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6139_input", 0, 0, {}]]]}, {"name": "conv1d_6142", "class_name": "Conv1D", "config": {"name": "conv1d_6142", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6142_input", 0, 0, {}]]]}, {"name": "max_pooling1d_6133", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6133", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6133", 0, 0, {}]]]}, {"name": "max_pooling1d_6136", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6136", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6136", 0, 0, {}]]]}, {"name": "max_pooling1d_6139", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6139", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6139", 0, 0, {}]]]}, {"name": "max_pooling1d_6142", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6142", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6142", 0, 0, {}]]]}, {"name": "conv1d_6134", "class_name": "Conv1D", "config": {"name": "conv1d_6134", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6133", 0, 0, {}]]]}, {"name": "conv1d_6137", "class_name": "Conv1D", "config": {"name": "conv1d_6137", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6136", 0, 0, {}]]]}, {"name": "conv1d_6140", "class_name": "Conv1D", "config": {"name": "conv1d_6140", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6139", 0, 0, {}]]]}, {"name": "conv1d_6143", "class_name": "Conv1D", "config": {"name": "conv1d_6143", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6142", 0, 0, {}]]]}, {"name": "max_pooling1d_6134", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6134", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6134", 0, 0, {}]]]}, {"name": "max_pooling1d_6137", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6137", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6137", 0, 0, {}]]]}, {"name": "max_pooling1d_6140", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6140", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6140", 0, 0, {}]]]}, {"name": "max_pooling1d_6143", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6143", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6143", 0, 0, {}]]]}, {"name": "conv1d_6135", "class_name": "Conv1D", "config": {"name": "conv1d_6135", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6134", 0, 0, {}]]]}, {"name": "conv1d_6138", "class_name": "Conv1D", "config": {"name": "conv1d_6138", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6137", 0, 0, {}]]]}, {"name": "conv1d_6141", "class_name": "Conv1D", "config": {"name": "conv1d_6141", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6140", 0, 0, {}]]]}, {"name": "conv1d_6144", "class_name": "Conv1D", "config": {"name": "conv1d_6144", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6143", 0, 0, {}]]]}, {"name": "max_pooling1d_6135", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6135", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6135", 0, 0, {}]]]}, {"name": "max_pooling1d_6138", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6138", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6138", 0, 0, {}]]]}, {"name": "max_pooling1d_6141", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6141", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6141", 0, 0, {}]]]}, {"name": "max_pooling1d_6144", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6144", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6144", 0, 0, {}]]]}, {"name": "flatten_2045", "class_name": "Flatten", "config": {"name": "flatten_2045", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6135", 0, 0, {}]]]}, {"name": "flatten_2046", "class_name": "Flatten", "config": {"name": "flatten_2046", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6138", 0, 0, {}]]]}, {"name": "flatten_2047", "class_name": "Flatten", "config": {"name": "flatten_2047", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6141", 0, 0, {}]]]}, {"name": "flatten_2048", "class_name": "Flatten", "config": {"name": "flatten_2048", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6144", 0, 0, {}]]]}, {"name": "concatenate_512", "class_name": "Concatenate", "config": {"name": "concatenate_512", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_2045", 0, 0, {}], ["flatten_2046", 0, 0, {}], ["flatten_2047", 0, 0, {}], ["flatten_2048", 0, 0, {}]]]}, {"name": "dense_1023", "class_name": "Dense", "config": {"name": "dense_1023", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_512", 0, 0, {}]]]}, {"name": "dense_1024", "class_name": "Dense", "config": {"name": "dense_1024", "trainable": true, "units": 2, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_1023", 0, 0, {}]]]}], "input_layers": [["conv1d_6133_input", 0, 0], ["conv1d_6136_input", 0, 0], ["conv1d_6139_input", 0, 0], ["conv1d_6142_input", 0, 0]], "output_layers": [["dense_1024", 0, 0]]}, "keras_version": "2.2.4", "backend": "theano"}