{"class_name": "Model", "config": {"name": "model_514", "layers": [{"name": "conv1d_6157_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6157_input"}, "inbound_nodes": []}, {"name": "conv1d_6160_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6160_input"}, "inbound_nodes": []}, {"name": "conv1d_6163_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6163_input"}, "inbound_nodes": []}, {"name": "conv1d_6166_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_6166_input"}, "inbound_nodes": []}, {"name": "conv1d_6157", "class_name": "Conv1D", "config": {"name": "conv1d_6157", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6157_input", 0, 0, {}]]]}, {"name": "conv1d_6160", "class_name": "Conv1D", "config": {"name": "conv1d_6160", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6160_input", 0, 0, {}]]]}, {"name": "conv1d_6163", "class_name": "Conv1D", "config": {"name": "conv1d_6163", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6163_input", 0, 0, {}]]]}, {"name": "conv1d_6166", "class_name": "Conv1D", "config": {"name": "conv1d_6166", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_6166_input", 0, 0, {}]]]}, {"name": "max_pooling1d_6157", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6157", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6157", 0, 0, {}]]]}, {"name": "max_pooling1d_6160", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6160", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6160", 0, 0, {}]]]}, {"name": "max_pooling1d_6163", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6163", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6163", 0, 0, {}]]]}, {"name": "max_pooling1d_6166", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6166", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6166", 0, 0, {}]]]}, {"name": "conv1d_6158", "class_name": "Conv1D", "config": {"name": "conv1d_6158", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6157", 0, 0, {}]]]}, {"name": "conv1d_6161", "class_name": "Conv1D", "config": {"name": "conv1d_6161", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6160", 0, 0, {}]]]}, {"name": "conv1d_6164", "class_name": "Conv1D", "config": {"name": "conv1d_6164", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6163", 0, 0, {}]]]}, {"name": "conv1d_6167", "class_name": "Conv1D", "config": {"name": "conv1d_6167", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6166", 0, 0, {}]]]}, {"name": "max_pooling1d_6158", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6158", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6158", 0, 0, {}]]]}, {"name": "max_pooling1d_6161", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6161", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6161", 0, 0, {}]]]}, {"name": "max_pooling1d_6164", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6164", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6164", 0, 0, {}]]]}, {"name": "max_pooling1d_6167", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6167", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6167", 0, 0, {}]]]}, {"name": "conv1d_6159", "class_name": "Conv1D", "config": {"name": "conv1d_6159", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6158", 0, 0, {}]]]}, {"name": "conv1d_6162", "class_name": "Conv1D", "config": {"name": "conv1d_6162", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6161", 0, 0, {}]]]}, {"name": "conv1d_6165", "class_name": "Conv1D", "config": {"name": "conv1d_6165", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6164", 0, 0, {}]]]}, {"name": "conv1d_6168", "class_name": "Conv1D", "config": {"name": "conv1d_6168", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_6167", 0, 0, {}]]]}, {"name": "max_pooling1d_6159", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6159", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6159", 0, 0, {}]]]}, {"name": "max_pooling1d_6162", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6162", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6162", 0, 0, {}]]]}, {"name": "max_pooling1d_6165", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6165", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6165", 0, 0, {}]]]}, {"name": "max_pooling1d_6168", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6168", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_6168", 0, 0, {}]]]}, {"name": "flatten_2053", "class_name": "Flatten", "config": {"name": "flatten_2053", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6159", 0, 0, {}]]]}, {"name": "flatten_2054", "class_name": "Flatten", "config": {"name": "flatten_2054", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6162", 0, 0, {}]]]}, {"name": "flatten_2055", "class_name": "Flatten", "config": {"name": "flatten_2055", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6165", 0, 0, {}]]]}, {"name": "flatten_2056", "class_name": "Flatten", "config": {"name": "flatten_2056", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_6168", 0, 0, {}]]]}, {"name": "concatenate_514", "class_name": "Concatenate", "config": {"name": "concatenate_514", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_2053", 0, 0, {}], ["flatten_2054", 0, 0, {}], ["flatten_2055", 0, 0, {}], ["flatten_2056", 0, 0, {}]]]}, {"name": "dense_1027", "class_name": "Dense", "config": {"name": "dense_1027", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_514", 0, 0, {}]]]}, {"name": "dense_1028", "class_name": "Dense", "config": {"name": "dense_1028", "trainable": true, "units": 2, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_1027", 0, 0, {}]]]}], "input_layers": [["conv1d_6157_input", 0, 0], ["conv1d_6160_input", 0, 0], ["conv1d_6163_input", 0, 0], ["conv1d_6166_input", 0, 0]], "output_layers": [["dense_1028", 0, 0]]}, "keras_version": "2.2.4", "backend": "theano"}