{"class_name": "Model", "config": {"name": "model_485", "layers": [{"name": "conv1d_5809_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5809_input"}, "inbound_nodes": []}, {"name": "conv1d_5812_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5812_input"}, "inbound_nodes": []}, {"name": "conv1d_5815_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5815_input"}, "inbound_nodes": []}, {"name": "conv1d_5818_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5818_input"}, "inbound_nodes": []}, {"name": "conv1d_5809", "class_name": "Conv1D", "config": {"name": "conv1d_5809", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5809_input", 0, 0, {}]]]}, {"name": "conv1d_5812", "class_name": "Conv1D", "config": {"name": "conv1d_5812", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5812_input", 0, 0, {}]]]}, {"name": "conv1d_5815", "class_name": "Conv1D", "config": {"name": "conv1d_5815", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5815_input", 0, 0, {}]]]}, {"name": "conv1d_5818", "class_name": "Conv1D", "config": {"name": "conv1d_5818", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5818_input", 0, 0, {}]]]}, {"name": "max_pooling1d_5809", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5809", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5809", 0, 0, {}]]]}, {"name": "max_pooling1d_5812", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5812", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5812", 0, 0, {}]]]}, {"name": "max_pooling1d_5815", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5815", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5815", 0, 0, {}]]]}, {"name": "max_pooling1d_5818", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5818", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5818", 0, 0, {}]]]}, {"name": "conv1d_5810", "class_name": "Conv1D", "config": {"name": "conv1d_5810", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5809", 0, 0, {}]]]}, {"name": "conv1d_5813", "class_name": "Conv1D", "config": {"name": "conv1d_5813", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5812", 0, 0, {}]]]}, {"name": "conv1d_5816", "class_name": "Conv1D", "config": {"name": "conv1d_5816", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5815", 0, 0, {}]]]}, {"name": "conv1d_5819", "class_name": "Conv1D", "config": {"name": "conv1d_5819", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5818", 0, 0, {}]]]}, {"name": "max_pooling1d_5810", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5810", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5810", 0, 0, {}]]]}, {"name": "max_pooling1d_5813", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5813", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5813", 0, 0, {}]]]}, {"name": "max_pooling1d_5816", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5816", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5816", 0, 0, {}]]]}, {"name": "max_pooling1d_5819", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5819", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5819", 0, 0, {}]]]}, {"name": "conv1d_5811", "class_name": "Conv1D", "config": {"name": "conv1d_5811", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5810", 0, 0, {}]]]}, {"name": "conv1d_5814", "class_name": "Conv1D", "config": {"name": "conv1d_5814", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5813", 0, 0, {}]]]}, {"name": "conv1d_5817", "class_name": "Conv1D", "config": {"name": "conv1d_5817", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5816", 0, 0, {}]]]}, {"name": "conv1d_5820", "class_name": "Conv1D", "config": {"name": "conv1d_5820", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5819", 0, 0, {}]]]}, {"name": "max_pooling1d_5811", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5811", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5811", 0, 0, {}]]]}, {"name": "max_pooling1d_5814", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5814", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5814", 0, 0, {}]]]}, {"name": "max_pooling1d_5817", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5817", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5817", 0, 0, {}]]]}, {"name": "max_pooling1d_5820", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5820", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5820", 0, 0, {}]]]}, {"name": "flatten_1937", "class_name": "Flatten", "config": {"name": "flatten_1937", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5811", 0, 0, {}]]]}, {"name": "flatten_1938", "class_name": "Flatten", "config": {"name": "flatten_1938", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5814", 0, 0, {}]]]}, {"name": "flatten_1939", "class_name": "Flatten", "config": {"name": "flatten_1939", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5817", 0, 0, {}]]]}, {"name": "flatten_1940", "class_name": "Flatten", "config": {"name": "flatten_1940", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5820", 0, 0, {}]]]}, {"name": "concatenate_485", "class_name": "Concatenate", "config": {"name": "concatenate_485", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_1937", 0, 0, {}], ["flatten_1938", 0, 0, {}], ["flatten_1939", 0, 0, {}], ["flatten_1940", 0, 0, {}]]]}, {"name": "dense_969", "class_name": "Dense", "config": {"name": "dense_969", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_485", 0, 0, {}]]]}, {"name": "dense_970", "class_name": "Dense", "config": {"name": "dense_970", "trainable": true, "units": 2, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_969", 0, 0, {}]]]}], "input_layers": [["conv1d_5809_input", 0, 0], ["conv1d_5812_input", 0, 0], ["conv1d_5815_input", 0, 0], ["conv1d_5818_input", 0, 0]], "output_layers": [["dense_970", 0, 0]]}, "keras_version": "2.2.4", "backend": "theano"}