{"class_name": "Model", "config": {"name": "model_481", "layers": [{"name": "conv1d_5761_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5761_input"}, "inbound_nodes": []}, {"name": "conv1d_5764_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5764_input"}, "inbound_nodes": []}, {"name": "conv1d_5767_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5767_input"}, "inbound_nodes": []}, {"name": "conv1d_5770_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5770_input"}, "inbound_nodes": []}, {"name": "conv1d_5761", "class_name": "Conv1D", "config": {"name": "conv1d_5761", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5761_input", 0, 0, {}]]]}, {"name": "conv1d_5764", "class_name": "Conv1D", "config": {"name": "conv1d_5764", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5764_input", 0, 0, {}]]]}, {"name": "conv1d_5767", "class_name": "Conv1D", "config": {"name": "conv1d_5767", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5767_input", 0, 0, {}]]]}, {"name": "conv1d_5770", "class_name": "Conv1D", "config": {"name": "conv1d_5770", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5770_input", 0, 0, {}]]]}, {"name": "max_pooling1d_5761", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5761", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5761", 0, 0, {}]]]}, {"name": "max_pooling1d_5764", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5764", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5764", 0, 0, {}]]]}, {"name": "max_pooling1d_5767", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5767", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5767", 0, 0, {}]]]}, {"name": "max_pooling1d_5770", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5770", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5770", 0, 0, {}]]]}, {"name": "conv1d_5762", "class_name": "Conv1D", "config": {"name": "conv1d_5762", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5761", 0, 0, {}]]]}, {"name": "conv1d_5765", "class_name": "Conv1D", "config": {"name": "conv1d_5765", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5764", 0, 0, {}]]]}, {"name": "conv1d_5768", "class_name": "Conv1D", "config": {"name": "conv1d_5768", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5767", 0, 0, {}]]]}, {"name": "conv1d_5771", "class_name": "Conv1D", "config": {"name": "conv1d_5771", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5770", 0, 0, {}]]]}, {"name": "max_pooling1d_5762", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5762", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5762", 0, 0, {}]]]}, {"name": "max_pooling1d_5765", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5765", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5765", 0, 0, {}]]]}, {"name": "max_pooling1d_5768", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5768", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5768", 0, 0, {}]]]}, {"name": "max_pooling1d_5771", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5771", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5771", 0, 0, {}]]]}, {"name": "conv1d_5763", "class_name": "Conv1D", "config": {"name": "conv1d_5763", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5762", 0, 0, {}]]]}, {"name": "conv1d_5766", "class_name": "Conv1D", "config": {"name": "conv1d_5766", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5765", 0, 0, {}]]]}, {"name": "conv1d_5769", "class_name": "Conv1D", "config": {"name": "conv1d_5769", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5768", 0, 0, {}]]]}, {"name": "conv1d_5772", "class_name": "Conv1D", "config": {"name": "conv1d_5772", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5771", 0, 0, {}]]]}, {"name": "max_pooling1d_5763", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5763", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5763", 0, 0, {}]]]}, {"name": "max_pooling1d_5766", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5766", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5766", 0, 0, {}]]]}, {"name": "max_pooling1d_5769", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5769", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5769", 0, 0, {}]]]}, {"name": "max_pooling1d_5772", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5772", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5772", 0, 0, {}]]]}, {"name": "flatten_1921", "class_name": "Flatten", "config": {"name": "flatten_1921", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5763", 0, 0, {}]]]}, {"name": "flatten_1922", "class_name": "Flatten", "config": {"name": "flatten_1922", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5766", 0, 0, {}]]]}, {"name": "flatten_1923", "class_name": "Flatten", "config": {"name": "flatten_1923", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5769", 0, 0, {}]]]}, {"name": "flatten_1924", "class_name": "Flatten", "config": {"name": "flatten_1924", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5772", 0, 0, {}]]]}, {"name": "concatenate_481", "class_name": "Concatenate", "config": {"name": "concatenate_481", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_1921", 0, 0, {}], ["flatten_1922", 0, 0, {}], ["flatten_1923", 0, 0, {}], ["flatten_1924", 0, 0, {}]]]}, {"name": "dense_961", "class_name": "Dense", "config": {"name": "dense_961", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_481", 0, 0, {}]]]}, {"name": "dense_962", "class_name": "Dense", "config": {"name": "dense_962", "trainable": true, "units": 2, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_961", 0, 0, {}]]]}], "input_layers": [["conv1d_5761_input", 0, 0], ["conv1d_5764_input", 0, 0], ["conv1d_5767_input", 0, 0], ["conv1d_5770_input", 0, 0]], "output_layers": [["dense_962", 0, 0]]}, "keras_version": "2.2.4", "backend": "theano"}