{"class_name": "Model", "config": {"name": "model_482", "layers": [{"name": "conv1d_5773_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5773_input"}, "inbound_nodes": []}, {"name": "conv1d_5776_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5776_input"}, "inbound_nodes": []}, {"name": "conv1d_5779_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5779_input"}, "inbound_nodes": []}, {"name": "conv1d_5782_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5782_input"}, "inbound_nodes": []}, {"name": "conv1d_5773", "class_name": "Conv1D", "config": {"name": "conv1d_5773", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5773_input", 0, 0, {}]]]}, {"name": "conv1d_5776", "class_name": "Conv1D", "config": {"name": "conv1d_5776", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5776_input", 0, 0, {}]]]}, {"name": "conv1d_5779", "class_name": "Conv1D", "config": {"name": "conv1d_5779", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5779_input", 0, 0, {}]]]}, {"name": "conv1d_5782", "class_name": "Conv1D", "config": {"name": "conv1d_5782", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5782_input", 0, 0, {}]]]}, {"name": "max_pooling1d_5773", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5773", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5773", 0, 0, {}]]]}, {"name": "max_pooling1d_5776", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5776", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5776", 0, 0, {}]]]}, {"name": "max_pooling1d_5779", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5779", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5779", 0, 0, {}]]]}, {"name": "max_pooling1d_5782", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5782", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5782", 0, 0, {}]]]}, {"name": "conv1d_5774", "class_name": "Conv1D", "config": {"name": "conv1d_5774", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5773", 0, 0, {}]]]}, {"name": "conv1d_5777", "class_name": "Conv1D", "config": {"name": "conv1d_5777", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5776", 0, 0, {}]]]}, {"name": "conv1d_5780", "class_name": "Conv1D", "config": {"name": "conv1d_5780", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5779", 0, 0, {}]]]}, {"name": "conv1d_5783", "class_name": "Conv1D", "config": {"name": "conv1d_5783", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5782", 0, 0, {}]]]}, {"name": "max_pooling1d_5774", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5774", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5774", 0, 0, {}]]]}, {"name": "max_pooling1d_5777", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5777", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5777", 0, 0, {}]]]}, {"name": "max_pooling1d_5780", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5780", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5780", 0, 0, {}]]]}, {"name": "max_pooling1d_5783", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5783", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5783", 0, 0, {}]]]}, {"name": "conv1d_5775", "class_name": "Conv1D", "config": {"name": "conv1d_5775", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5774", 0, 0, {}]]]}, {"name": "conv1d_5778", "class_name": "Conv1D", "config": {"name": "conv1d_5778", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5777", 0, 0, {}]]]}, {"name": "conv1d_5781", "class_name": "Conv1D", "config": {"name": "conv1d_5781", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5780", 0, 0, {}]]]}, {"name": "conv1d_5784", "class_name": "Conv1D", "config": {"name": "conv1d_5784", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5783", 0, 0, {}]]]}, {"name": "max_pooling1d_5775", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5775", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5775", 0, 0, {}]]]}, {"name": "max_pooling1d_5778", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5778", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5778", 0, 0, {}]]]}, {"name": "max_pooling1d_5781", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5781", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5781", 0, 0, {}]]]}, {"name": "max_pooling1d_5784", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5784", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5784", 0, 0, {}]]]}, {"name": "flatten_1925", "class_name": "Flatten", "config": {"name": "flatten_1925", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5775", 0, 0, {}]]]}, {"name": "flatten_1926", "class_name": "Flatten", "config": {"name": "flatten_1926", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5778", 0, 0, {}]]]}, {"name": "flatten_1927", "class_name": "Flatten", "config": {"name": "flatten_1927", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5781", 0, 0, {}]]]}, {"name": "flatten_1928", "class_name": "Flatten", "config": {"name": "flatten_1928", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5784", 0, 0, {}]]]}, {"name": "concatenate_482", "class_name": "Concatenate", "config": {"name": "concatenate_482", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_1925", 0, 0, {}], ["flatten_1926", 0, 0, {}], ["flatten_1927", 0, 0, {}], ["flatten_1928", 0, 0, {}]]]}, {"name": "dense_963", "class_name": "Dense", "config": {"name": "dense_963", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_482", 0, 0, {}]]]}, {"name": "dense_964", "class_name": "Dense", "config": {"name": "dense_964", "trainable": true, "units": 2, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_963", 0, 0, {}]]]}], "input_layers": [["conv1d_5773_input", 0, 0], ["conv1d_5776_input", 0, 0], ["conv1d_5779_input", 0, 0], ["conv1d_5782_input", 0, 0]], "output_layers": [["dense_964", 0, 0]]}, "keras_version": "2.2.4", "backend": "theano"}