{"class_name": "Model", "config": {"name": "model_483", "layers": [{"name": "conv1d_5785_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5785_input"}, "inbound_nodes": []}, {"name": "conv1d_5788_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5788_input"}, "inbound_nodes": []}, {"name": "conv1d_5791_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5791_input"}, "inbound_nodes": []}, {"name": "conv1d_5794_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5794_input"}, "inbound_nodes": []}, {"name": "conv1d_5785", "class_name": "Conv1D", "config": {"name": "conv1d_5785", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5785_input", 0, 0, {}]]]}, {"name": "conv1d_5788", "class_name": "Conv1D", "config": {"name": "conv1d_5788", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5788_input", 0, 0, {}]]]}, {"name": "conv1d_5791", "class_name": "Conv1D", "config": {"name": "conv1d_5791", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5791_input", 0, 0, {}]]]}, {"name": "conv1d_5794", "class_name": "Conv1D", "config": {"name": "conv1d_5794", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5794_input", 0, 0, {}]]]}, {"name": "max_pooling1d_5785", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5785", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5785", 0, 0, {}]]]}, {"name": "max_pooling1d_5788", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5788", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5788", 0, 0, {}]]]}, {"name": "max_pooling1d_5791", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5791", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5791", 0, 0, {}]]]}, {"name": "max_pooling1d_5794", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5794", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5794", 0, 0, {}]]]}, {"name": "conv1d_5786", "class_name": "Conv1D", "config": {"name": "conv1d_5786", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5785", 0, 0, {}]]]}, {"name": "conv1d_5789", "class_name": "Conv1D", "config": {"name": "conv1d_5789", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5788", 0, 0, {}]]]}, {"name": "conv1d_5792", "class_name": "Conv1D", "config": {"name": "conv1d_5792", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5791", 0, 0, {}]]]}, {"name": "conv1d_5795", "class_name": "Conv1D", "config": {"name": "conv1d_5795", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5794", 0, 0, {}]]]}, {"name": "max_pooling1d_5786", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5786", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5786", 0, 0, {}]]]}, {"name": "max_pooling1d_5789", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5789", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5789", 0, 0, {}]]]}, {"name": "max_pooling1d_5792", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5792", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5792", 0, 0, {}]]]}, {"name": "max_pooling1d_5795", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5795", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5795", 0, 0, {}]]]}, {"name": "conv1d_5787", "class_name": "Conv1D", "config": {"name": "conv1d_5787", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5786", 0, 0, {}]]]}, {"name": "conv1d_5790", "class_name": "Conv1D", "config": {"name": "conv1d_5790", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5789", 0, 0, {}]]]}, {"name": "conv1d_5793", "class_name": "Conv1D", "config": {"name": "conv1d_5793", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5792", 0, 0, {}]]]}, {"name": "conv1d_5796", "class_name": "Conv1D", "config": {"name": "conv1d_5796", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5795", 0, 0, {}]]]}, {"name": "max_pooling1d_5787", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5787", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5787", 0, 0, {}]]]}, {"name": "max_pooling1d_5790", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5790", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5790", 0, 0, {}]]]}, {"name": "max_pooling1d_5793", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5793", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5793", 0, 0, {}]]]}, {"name": "max_pooling1d_5796", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5796", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5796", 0, 0, {}]]]}, {"name": "flatten_1929", "class_name": "Flatten", "config": {"name": "flatten_1929", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5787", 0, 0, {}]]]}, {"name": "flatten_1930", "class_name": "Flatten", "config": {"name": "flatten_1930", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5790", 0, 0, {}]]]}, {"name": "flatten_1931", "class_name": "Flatten", "config": {"name": "flatten_1931", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5793", 0, 0, {}]]]}, {"name": "flatten_1932", "class_name": "Flatten", "config": {"name": "flatten_1932", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5796", 0, 0, {}]]]}, {"name": "concatenate_483", "class_name": "Concatenate", "config": {"name": "concatenate_483", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_1929", 0, 0, {}], ["flatten_1930", 0, 0, {}], ["flatten_1931", 0, 0, {}], ["flatten_1932", 0, 0, {}]]]}, {"name": "dense_965", "class_name": "Dense", "config": {"name": "dense_965", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_483", 0, 0, {}]]]}, {"name": "dense_966", "class_name": "Dense", "config": {"name": "dense_966", "trainable": true, "units": 2, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_965", 0, 0, {}]]]}], "input_layers": [["conv1d_5785_input", 0, 0], ["conv1d_5788_input", 0, 0], ["conv1d_5791_input", 0, 0], ["conv1d_5794_input", 0, 0]], "output_layers": [["dense_966", 0, 0]]}, "keras_version": "2.2.4", "backend": "theano"}