{"class_name": "Model", "config": {"name": "model_484", "layers": [{"name": "conv1d_5797_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5797_input"}, "inbound_nodes": []}, {"name": "conv1d_5800_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5800_input"}, "inbound_nodes": []}, {"name": "conv1d_5803_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5803_input"}, "inbound_nodes": []}, {"name": "conv1d_5806_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5806_input"}, "inbound_nodes": []}, {"name": "conv1d_5797", "class_name": "Conv1D", "config": {"name": "conv1d_5797", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5797_input", 0, 0, {}]]]}, {"name": "conv1d_5800", "class_name": "Conv1D", "config": {"name": "conv1d_5800", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5800_input", 0, 0, {}]]]}, {"name": "conv1d_5803", "class_name": "Conv1D", "config": {"name": "conv1d_5803", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5803_input", 0, 0, {}]]]}, {"name": "conv1d_5806", "class_name": "Conv1D", "config": {"name": "conv1d_5806", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5806_input", 0, 0, {}]]]}, {"name": "max_pooling1d_5797", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5797", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5797", 0, 0, {}]]]}, {"name": "max_pooling1d_5800", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5800", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5800", 0, 0, {}]]]}, {"name": "max_pooling1d_5803", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5803", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5803", 0, 0, {}]]]}, {"name": "max_pooling1d_5806", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5806", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5806", 0, 0, {}]]]}, {"name": "conv1d_5798", "class_name": "Conv1D", "config": {"name": "conv1d_5798", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5797", 0, 0, {}]]]}, {"name": "conv1d_5801", "class_name": "Conv1D", "config": {"name": "conv1d_5801", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5800", 0, 0, {}]]]}, {"name": "conv1d_5804", "class_name": "Conv1D", "config": {"name": "conv1d_5804", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5803", 0, 0, {}]]]}, {"name": "conv1d_5807", "class_name": "Conv1D", "config": {"name": "conv1d_5807", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5806", 0, 0, {}]]]}, {"name": "max_pooling1d_5798", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5798", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5798", 0, 0, {}]]]}, {"name": "max_pooling1d_5801", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5801", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5801", 0, 0, {}]]]}, {"name": "max_pooling1d_5804", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5804", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5804", 0, 0, {}]]]}, {"name": "max_pooling1d_5807", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5807", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5807", 0, 0, {}]]]}, {"name": "conv1d_5799", "class_name": "Conv1D", "config": {"name": "conv1d_5799", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5798", 0, 0, {}]]]}, {"name": "conv1d_5802", "class_name": "Conv1D", "config": {"name": "conv1d_5802", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5801", 0, 0, {}]]]}, {"name": "conv1d_5805", "class_name": "Conv1D", "config": {"name": "conv1d_5805", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5804", 0, 0, {}]]]}, {"name": "conv1d_5808", "class_name": "Conv1D", "config": {"name": "conv1d_5808", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5807", 0, 0, {}]]]}, {"name": "max_pooling1d_5799", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5799", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5799", 0, 0, {}]]]}, {"name": "max_pooling1d_5802", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5802", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5802", 0, 0, {}]]]}, {"name": "max_pooling1d_5805", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5805", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5805", 0, 0, {}]]]}, {"name": "max_pooling1d_5808", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5808", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5808", 0, 0, {}]]]}, {"name": "flatten_1933", "class_name": "Flatten", "config": {"name": "flatten_1933", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5799", 0, 0, {}]]]}, {"name": "flatten_1934", "class_name": "Flatten", "config": {"name": "flatten_1934", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5802", 0, 0, {}]]]}, {"name": "flatten_1935", "class_name": "Flatten", "config": {"name": "flatten_1935", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5805", 0, 0, {}]]]}, {"name": "flatten_1936", "class_name": "Flatten", "config": {"name": "flatten_1936", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5808", 0, 0, {}]]]}, {"name": "concatenate_484", "class_name": "Concatenate", "config": {"name": "concatenate_484", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_1933", 0, 0, {}], ["flatten_1934", 0, 0, {}], ["flatten_1935", 0, 0, {}], ["flatten_1936", 0, 0, {}]]]}, {"name": "dense_967", "class_name": "Dense", "config": {"name": "dense_967", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_484", 0, 0, {}]]]}, {"name": "dense_968", "class_name": "Dense", "config": {"name": "dense_968", "trainable": true, "units": 2, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_967", 0, 0, {}]]]}], "input_layers": [["conv1d_5797_input", 0, 0], ["conv1d_5800_input", 0, 0], ["conv1d_5803_input", 0, 0], ["conv1d_5806_input", 0, 0]], "output_layers": [["dense_968", 0, 0]]}, "keras_version": "2.2.4", "backend": "theano"}