{"class_name": "Model", "config": {"name": "model_489", "layers": [{"name": "conv1d_5857_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5857_input"}, "inbound_nodes": []}, {"name": "conv1d_5860_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5860_input"}, "inbound_nodes": []}, {"name": "conv1d_5863_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5863_input"}, "inbound_nodes": []}, {"name": "conv1d_5866_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5866_input"}, "inbound_nodes": []}, {"name": "conv1d_5857", "class_name": "Conv1D", "config": {"name": "conv1d_5857", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5857_input", 0, 0, {}]]]}, {"name": "conv1d_5860", "class_name": "Conv1D", "config": {"name": "conv1d_5860", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5860_input", 0, 0, {}]]]}, {"name": "conv1d_5863", "class_name": "Conv1D", "config": {"name": "conv1d_5863", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5863_input", 0, 0, {}]]]}, {"name": "conv1d_5866", "class_name": "Conv1D", "config": {"name": "conv1d_5866", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5866_input", 0, 0, {}]]]}, {"name": "max_pooling1d_5857", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5857", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5857", 0, 0, {}]]]}, {"name": "max_pooling1d_5860", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5860", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5860", 0, 0, {}]]]}, {"name": "max_pooling1d_5863", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5863", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5863", 0, 0, {}]]]}, {"name": "max_pooling1d_5866", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5866", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5866", 0, 0, {}]]]}, {"name": "conv1d_5858", "class_name": "Conv1D", "config": {"name": "conv1d_5858", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5857", 0, 0, {}]]]}, {"name": "conv1d_5861", "class_name": "Conv1D", "config": {"name": "conv1d_5861", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5860", 0, 0, {}]]]}, {"name": "conv1d_5864", "class_name": "Conv1D", "config": {"name": "conv1d_5864", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5863", 0, 0, {}]]]}, {"name": "conv1d_5867", "class_name": "Conv1D", "config": {"name": "conv1d_5867", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5866", 0, 0, {}]]]}, {"name": "max_pooling1d_5858", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5858", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5858", 0, 0, {}]]]}, {"name": "max_pooling1d_5861", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5861", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5861", 0, 0, {}]]]}, {"name": "max_pooling1d_5864", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5864", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5864", 0, 0, {}]]]}, {"name": "max_pooling1d_5867", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5867", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5867", 0, 0, {}]]]}, {"name": "conv1d_5859", "class_name": "Conv1D", "config": {"name": "conv1d_5859", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5858", 0, 0, {}]]]}, {"name": "conv1d_5862", "class_name": "Conv1D", "config": {"name": "conv1d_5862", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5861", 0, 0, {}]]]}, {"name": "conv1d_5865", "class_name": "Conv1D", "config": {"name": "conv1d_5865", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5864", 0, 0, {}]]]}, {"name": "conv1d_5868", "class_name": "Conv1D", "config": {"name": "conv1d_5868", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5867", 0, 0, {}]]]}, {"name": "max_pooling1d_5859", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5859", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5859", 0, 0, {}]]]}, {"name": "max_pooling1d_5862", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5862", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5862", 0, 0, {}]]]}, {"name": "max_pooling1d_5865", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5865", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5865", 0, 0, {}]]]}, {"name": "max_pooling1d_5868", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5868", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5868", 0, 0, {}]]]}, {"name": "flatten_1953", "class_name": "Flatten", "config": {"name": "flatten_1953", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5859", 0, 0, {}]]]}, {"name": "flatten_1954", "class_name": "Flatten", "config": {"name": "flatten_1954", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5862", 0, 0, {}]]]}, {"name": "flatten_1955", "class_name": "Flatten", "config": {"name": "flatten_1955", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5865", 0, 0, {}]]]}, {"name": "flatten_1956", "class_name": "Flatten", "config": {"name": "flatten_1956", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5868", 0, 0, {}]]]}, {"name": "concatenate_489", "class_name": "Concatenate", "config": {"name": "concatenate_489", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_1953", 0, 0, {}], ["flatten_1954", 0, 0, {}], ["flatten_1955", 0, 0, {}], ["flatten_1956", 0, 0, {}]]]}, {"name": "dense_977", "class_name": "Dense", "config": {"name": "dense_977", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_489", 0, 0, {}]]]}, {"name": "dense_978", "class_name": "Dense", "config": {"name": "dense_978", "trainable": true, "units": 2, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_977", 0, 0, {}]]]}], "input_layers": [["conv1d_5857_input", 0, 0], ["conv1d_5860_input", 0, 0], ["conv1d_5863_input", 0, 0], ["conv1d_5866_input", 0, 0]], "output_layers": [["dense_978", 0, 0]]}, "keras_version": "2.2.4", "backend": "theano"}