{"class_name": "Model", "config": {"name": "model_488", "layers": [{"name": "conv1d_5845_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5845_input"}, "inbound_nodes": []}, {"name": "conv1d_5848_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5848_input"}, "inbound_nodes": []}, {"name": "conv1d_5851_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5851_input"}, "inbound_nodes": []}, {"name": "conv1d_5854_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5854_input"}, "inbound_nodes": []}, {"name": "conv1d_5845", "class_name": "Conv1D", "config": {"name": "conv1d_5845", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5845_input", 0, 0, {}]]]}, {"name": "conv1d_5848", "class_name": "Conv1D", "config": {"name": "conv1d_5848", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5848_input", 0, 0, {}]]]}, {"name": "conv1d_5851", "class_name": "Conv1D", "config": {"name": "conv1d_5851", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5851_input", 0, 0, {}]]]}, {"name": "conv1d_5854", "class_name": "Conv1D", "config": {"name": "conv1d_5854", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5854_input", 0, 0, {}]]]}, {"name": "max_pooling1d_5845", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5845", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5845", 0, 0, {}]]]}, {"name": "max_pooling1d_5848", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5848", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5848", 0, 0, {}]]]}, {"name": "max_pooling1d_5851", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5851", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5851", 0, 0, {}]]]}, {"name": "max_pooling1d_5854", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5854", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5854", 0, 0, {}]]]}, {"name": "conv1d_5846", "class_name": "Conv1D", "config": {"name": "conv1d_5846", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5845", 0, 0, {}]]]}, {"name": "conv1d_5849", "class_name": "Conv1D", "config": {"name": "conv1d_5849", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5848", 0, 0, {}]]]}, {"name": "conv1d_5852", "class_name": "Conv1D", "config": {"name": "conv1d_5852", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5851", 0, 0, {}]]]}, {"name": "conv1d_5855", "class_name": "Conv1D", "config": {"name": "conv1d_5855", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5854", 0, 0, {}]]]}, {"name": "max_pooling1d_5846", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5846", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5846", 0, 0, {}]]]}, {"name": "max_pooling1d_5849", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5849", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5849", 0, 0, {}]]]}, {"name": "max_pooling1d_5852", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5852", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5852", 0, 0, {}]]]}, {"name": "max_pooling1d_5855", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5855", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5855", 0, 0, {}]]]}, {"name": "conv1d_5847", "class_name": "Conv1D", "config": {"name": "conv1d_5847", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5846", 0, 0, {}]]]}, {"name": "conv1d_5850", "class_name": "Conv1D", "config": {"name": "conv1d_5850", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5849", 0, 0, {}]]]}, {"name": "conv1d_5853", "class_name": "Conv1D", "config": {"name": "conv1d_5853", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5852", 0, 0, {}]]]}, {"name": "conv1d_5856", "class_name": "Conv1D", "config": {"name": "conv1d_5856", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5855", 0, 0, {}]]]}, {"name": "max_pooling1d_5847", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5847", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5847", 0, 0, {}]]]}, {"name": "max_pooling1d_5850", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5850", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5850", 0, 0, {}]]]}, {"name": "max_pooling1d_5853", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5853", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5853", 0, 0, {}]]]}, {"name": "max_pooling1d_5856", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5856", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5856", 0, 0, {}]]]}, {"name": "flatten_1949", "class_name": "Flatten", "config": {"name": "flatten_1949", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5847", 0, 0, {}]]]}, {"name": "flatten_1950", "class_name": "Flatten", "config": {"name": "flatten_1950", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5850", 0, 0, {}]]]}, {"name": "flatten_1951", "class_name": "Flatten", "config": {"name": "flatten_1951", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5853", 0, 0, {}]]]}, {"name": "flatten_1952", "class_name": "Flatten", "config": {"name": "flatten_1952", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5856", 0, 0, {}]]]}, {"name": "concatenate_488", "class_name": "Concatenate", "config": {"name": "concatenate_488", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_1949", 0, 0, {}], ["flatten_1950", 0, 0, {}], ["flatten_1951", 0, 0, {}], ["flatten_1952", 0, 0, {}]]]}, {"name": "dense_975", "class_name": "Dense", "config": {"name": "dense_975", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_488", 0, 0, {}]]]}, {"name": "dense_976", "class_name": "Dense", "config": {"name": "dense_976", "trainable": true, "units": 2, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_975", 0, 0, {}]]]}], "input_layers": [["conv1d_5845_input", 0, 0], ["conv1d_5848_input", 0, 0], ["conv1d_5851_input", 0, 0], ["conv1d_5854_input", 0, 0]], "output_layers": [["dense_976", 0, 0]]}, "keras_version": "2.2.4", "backend": "theano"}