{"class_name": "Model", "config": {"name": "model_490", "layers": [{"name": "conv1d_5869_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5869_input"}, "inbound_nodes": []}, {"name": "conv1d_5872_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5872_input"}, "inbound_nodes": []}, {"name": "conv1d_5875_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5875_input"}, "inbound_nodes": []}, {"name": "conv1d_5878_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5878_input"}, "inbound_nodes": []}, {"name": "conv1d_5869", "class_name": "Conv1D", "config": {"name": "conv1d_5869", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5869_input", 0, 0, {}]]]}, {"name": "conv1d_5872", "class_name": "Conv1D", "config": {"name": "conv1d_5872", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5872_input", 0, 0, {}]]]}, {"name": "conv1d_5875", "class_name": "Conv1D", "config": {"name": "conv1d_5875", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5875_input", 0, 0, {}]]]}, {"name": "conv1d_5878", "class_name": "Conv1D", "config": {"name": "conv1d_5878", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5878_input", 0, 0, {}]]]}, {"name": "max_pooling1d_5869", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5869", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5869", 0, 0, {}]]]}, {"name": "max_pooling1d_5872", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5872", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5872", 0, 0, {}]]]}, {"name": "max_pooling1d_5875", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5875", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5875", 0, 0, {}]]]}, {"name": "max_pooling1d_5878", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5878", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5878", 0, 0, {}]]]}, {"name": "conv1d_5870", "class_name": "Conv1D", "config": {"name": "conv1d_5870", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5869", 0, 0, {}]]]}, {"name": "conv1d_5873", "class_name": "Conv1D", "config": {"name": "conv1d_5873", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5872", 0, 0, {}]]]}, {"name": "conv1d_5876", "class_name": "Conv1D", "config": {"name": "conv1d_5876", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5875", 0, 0, {}]]]}, {"name": "conv1d_5879", "class_name": "Conv1D", "config": {"name": "conv1d_5879", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5878", 0, 0, {}]]]}, {"name": "max_pooling1d_5870", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5870", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5870", 0, 0, {}]]]}, {"name": "max_pooling1d_5873", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5873", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5873", 0, 0, {}]]]}, {"name": "max_pooling1d_5876", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5876", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5876", 0, 0, {}]]]}, {"name": "max_pooling1d_5879", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5879", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5879", 0, 0, {}]]]}, {"name": "conv1d_5871", "class_name": "Conv1D", "config": {"name": "conv1d_5871", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5870", 0, 0, {}]]]}, {"name": "conv1d_5874", "class_name": "Conv1D", "config": {"name": "conv1d_5874", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5873", 0, 0, {}]]]}, {"name": "conv1d_5877", "class_name": "Conv1D", "config": {"name": "conv1d_5877", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5876", 0, 0, {}]]]}, {"name": "conv1d_5880", "class_name": "Conv1D", "config": {"name": "conv1d_5880", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5879", 0, 0, {}]]]}, {"name": "max_pooling1d_5871", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5871", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5871", 0, 0, {}]]]}, {"name": "max_pooling1d_5874", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5874", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5874", 0, 0, {}]]]}, {"name": "max_pooling1d_5877", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5877", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5877", 0, 0, {}]]]}, {"name": "max_pooling1d_5880", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5880", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5880", 0, 0, {}]]]}, {"name": "flatten_1957", "class_name": "Flatten", "config": {"name": "flatten_1957", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5871", 0, 0, {}]]]}, {"name": "flatten_1958", "class_name": "Flatten", "config": {"name": "flatten_1958", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5874", 0, 0, {}]]]}, {"name": "flatten_1959", "class_name": "Flatten", "config": {"name": "flatten_1959", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5877", 0, 0, {}]]]}, {"name": "flatten_1960", "class_name": "Flatten", "config": {"name": "flatten_1960", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5880", 0, 0, {}]]]}, {"name": "concatenate_490", "class_name": "Concatenate", "config": {"name": "concatenate_490", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_1957", 0, 0, {}], ["flatten_1958", 0, 0, {}], ["flatten_1959", 0, 0, {}], ["flatten_1960", 0, 0, {}]]]}, {"name": "dense_979", "class_name": "Dense", "config": {"name": "dense_979", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_490", 0, 0, {}]]]}, {"name": "dense_980", "class_name": "Dense", "config": {"name": "dense_980", "trainable": true, "units": 2, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_979", 0, 0, {}]]]}], "input_layers": [["conv1d_5869_input", 0, 0], ["conv1d_5872_input", 0, 0], ["conv1d_5875_input", 0, 0], ["conv1d_5878_input", 0, 0]], "output_layers": [["dense_980", 0, 0]]}, "keras_version": "2.2.4", "backend": "theano"}