{"class_name": "Model", "config": {"name": "model_487", "layers": [{"name": "conv1d_5833_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5833_input"}, "inbound_nodes": []}, {"name": "conv1d_5836_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5836_input"}, "inbound_nodes": []}, {"name": "conv1d_5839_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5839_input"}, "inbound_nodes": []}, {"name": "conv1d_5842_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5842_input"}, "inbound_nodes": []}, {"name": "conv1d_5833", "class_name": "Conv1D", "config": {"name": "conv1d_5833", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5833_input", 0, 0, {}]]]}, {"name": "conv1d_5836", "class_name": "Conv1D", "config": {"name": "conv1d_5836", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5836_input", 0, 0, {}]]]}, {"name": "conv1d_5839", "class_name": "Conv1D", "config": {"name": "conv1d_5839", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5839_input", 0, 0, {}]]]}, {"name": "conv1d_5842", "class_name": "Conv1D", "config": {"name": "conv1d_5842", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5842_input", 0, 0, {}]]]}, {"name": "max_pooling1d_5833", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5833", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5833", 0, 0, {}]]]}, {"name": "max_pooling1d_5836", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5836", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5836", 0, 0, {}]]]}, {"name": "max_pooling1d_5839", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5839", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5839", 0, 0, {}]]]}, {"name": "max_pooling1d_5842", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5842", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5842", 0, 0, {}]]]}, {"name": "conv1d_5834", "class_name": "Conv1D", "config": {"name": "conv1d_5834", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5833", 0, 0, {}]]]}, {"name": "conv1d_5837", "class_name": "Conv1D", "config": {"name": "conv1d_5837", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5836", 0, 0, {}]]]}, {"name": "conv1d_5840", "class_name": "Conv1D", "config": {"name": "conv1d_5840", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5839", 0, 0, {}]]]}, {"name": "conv1d_5843", "class_name": "Conv1D", "config": {"name": "conv1d_5843", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5842", 0, 0, {}]]]}, {"name": "max_pooling1d_5834", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5834", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5834", 0, 0, {}]]]}, {"name": "max_pooling1d_5837", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5837", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5837", 0, 0, {}]]]}, {"name": "max_pooling1d_5840", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5840", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5840", 0, 0, {}]]]}, {"name": "max_pooling1d_5843", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5843", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5843", 0, 0, {}]]]}, {"name": "conv1d_5835", "class_name": "Conv1D", "config": {"name": "conv1d_5835", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5834", 0, 0, {}]]]}, {"name": "conv1d_5838", "class_name": "Conv1D", "config": {"name": "conv1d_5838", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5837", 0, 0, {}]]]}, {"name": "conv1d_5841", "class_name": "Conv1D", "config": {"name": "conv1d_5841", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5840", 0, 0, {}]]]}, {"name": "conv1d_5844", "class_name": "Conv1D", "config": {"name": "conv1d_5844", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5843", 0, 0, {}]]]}, {"name": "max_pooling1d_5835", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5835", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5835", 0, 0, {}]]]}, {"name": "max_pooling1d_5838", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5838", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5838", 0, 0, {}]]]}, {"name": "max_pooling1d_5841", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5841", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5841", 0, 0, {}]]]}, {"name": "max_pooling1d_5844", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5844", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5844", 0, 0, {}]]]}, {"name": "flatten_1945", "class_name": "Flatten", "config": {"name": "flatten_1945", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5835", 0, 0, {}]]]}, {"name": "flatten_1946", "class_name": "Flatten", "config": {"name": "flatten_1946", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5838", 0, 0, {}]]]}, {"name": "flatten_1947", "class_name": "Flatten", "config": {"name": "flatten_1947", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5841", 0, 0, {}]]]}, {"name": "flatten_1948", "class_name": "Flatten", "config": {"name": "flatten_1948", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5844", 0, 0, {}]]]}, {"name": "concatenate_487", "class_name": "Concatenate", "config": {"name": "concatenate_487", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_1945", 0, 0, {}], ["flatten_1946", 0, 0, {}], ["flatten_1947", 0, 0, {}], ["flatten_1948", 0, 0, {}]]]}, {"name": "dense_973", "class_name": "Dense", "config": {"name": "dense_973", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_487", 0, 0, {}]]]}, {"name": "dense_974", "class_name": "Dense", "config": {"name": "dense_974", "trainable": true, "units": 2, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_973", 0, 0, {}]]]}], "input_layers": [["conv1d_5833_input", 0, 0], ["conv1d_5836_input", 0, 0], ["conv1d_5839_input", 0, 0], ["conv1d_5842_input", 0, 0]], "output_layers": [["dense_974", 0, 0]]}, "keras_version": "2.2.4", "backend": "theano"}