{"class_name": "Model", "config": {"name": "model_486", "layers": [{"name": "conv1d_5821_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5821_input"}, "inbound_nodes": []}, {"name": "conv1d_5824_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5824_input"}, "inbound_nodes": []}, {"name": "conv1d_5827_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5827_input"}, "inbound_nodes": []}, {"name": "conv1d_5830_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 1], "dtype": "float32", "sparse": false, "name": "conv1d_5830_input"}, "inbound_nodes": []}, {"name": "conv1d_5821", "class_name": "Conv1D", "config": {"name": "conv1d_5821", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5821_input", 0, 0, {}]]]}, {"name": "conv1d_5824", "class_name": "Conv1D", "config": {"name": "conv1d_5824", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5824_input", 0, 0, {}]]]}, {"name": "conv1d_5827", "class_name": "Conv1D", "config": {"name": "conv1d_5827", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5827_input", 0, 0, {}]]]}, {"name": "conv1d_5830", "class_name": "Conv1D", "config": {"name": "conv1d_5830", "trainable": true, "batch_input_shape": [null, 9, 1], "dtype": "float32", "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_5830_input", 0, 0, {}]]]}, {"name": "max_pooling1d_5821", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5821", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5821", 0, 0, {}]]]}, {"name": "max_pooling1d_5824", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5824", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5824", 0, 0, {}]]]}, {"name": "max_pooling1d_5827", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5827", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5827", 0, 0, {}]]]}, {"name": "max_pooling1d_5830", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5830", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5830", 0, 0, {}]]]}, {"name": "conv1d_5822", "class_name": "Conv1D", "config": {"name": "conv1d_5822", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5821", 0, 0, {}]]]}, {"name": "conv1d_5825", "class_name": "Conv1D", "config": {"name": "conv1d_5825", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5824", 0, 0, {}]]]}, {"name": "conv1d_5828", "class_name": "Conv1D", "config": {"name": "conv1d_5828", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5827", 0, 0, {}]]]}, {"name": "conv1d_5831", "class_name": "Conv1D", "config": {"name": "conv1d_5831", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5830", 0, 0, {}]]]}, {"name": "max_pooling1d_5822", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5822", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5822", 0, 0, {}]]]}, {"name": "max_pooling1d_5825", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5825", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5825", 0, 0, {}]]]}, {"name": "max_pooling1d_5828", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5828", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5828", 0, 0, {}]]]}, {"name": "max_pooling1d_5831", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5831", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5831", 0, 0, {}]]]}, {"name": "conv1d_5823", "class_name": "Conv1D", "config": {"name": "conv1d_5823", "trainable": true, "filters": 64, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5822", 0, 0, {}]]]}, {"name": "conv1d_5826", "class_name": "Conv1D", "config": {"name": "conv1d_5826", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5825", 0, 0, {}]]]}, {"name": "conv1d_5829", "class_name": "Conv1D", "config": {"name": "conv1d_5829", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5828", 0, 0, {}]]]}, {"name": "conv1d_5832", "class_name": "Conv1D", "config": {"name": "conv1d_5832", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_5831", 0, 0, {}]]]}, {"name": "max_pooling1d_5823", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5823", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5823", 0, 0, {}]]]}, {"name": "max_pooling1d_5826", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5826", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5826", 0, 0, {}]]]}, {"name": "max_pooling1d_5829", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5829", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5829", 0, 0, {}]]]}, {"name": "max_pooling1d_5832", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5832", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5832", 0, 0, {}]]]}, {"name": "flatten_1941", "class_name": "Flatten", "config": {"name": "flatten_1941", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5823", 0, 0, {}]]]}, {"name": "flatten_1942", "class_name": "Flatten", "config": {"name": "flatten_1942", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5826", 0, 0, {}]]]}, {"name": "flatten_1943", "class_name": "Flatten", "config": {"name": "flatten_1943", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5829", 0, 0, {}]]]}, {"name": "flatten_1944", "class_name": "Flatten", "config": {"name": "flatten_1944", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_5832", 0, 0, {}]]]}, {"name": "concatenate_486", "class_name": "Concatenate", "config": {"name": "concatenate_486", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_1941", 0, 0, {}], ["flatten_1942", 0, 0, {}], ["flatten_1943", 0, 0, {}], ["flatten_1944", 0, 0, {}]]]}, {"name": "dense_971", "class_name": "Dense", "config": {"name": "dense_971", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_486", 0, 0, {}]]]}, {"name": "dense_972", "class_name": "Dense", "config": {"name": "dense_972", "trainable": true, "units": 2, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_971", 0, 0, {}]]]}], "input_layers": [["conv1d_5821_input", 0, 0], ["conv1d_5824_input", 0, 0], ["conv1d_5827_input", 0, 0], ["conv1d_5830_input", 0, 0]], "output_layers": [["dense_972", 0, 0]]}, "keras_version": "2.2.4", "backend": "theano"}